

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">

  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 버그헌팅 튜토리얼 Part 2 - hackyboiz">
  <meta property="og:description" content="hack &amp; life">
  <meta property="og:image" content="/img/favicon.ico">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/">

  <title>[Research] 버그헌팅 튜토리얼 Part 2 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>

<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-03-17 18:00" pubdate>
      2021년 3월 17일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.6k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      32
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 버그헌팅 튜토리얼 Part 2</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p><a href="https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 1</a></p>
<p>&#xC9C0;&#xB09C; Part 1&#xC5D0; &#xC774;&#xC5B4; &#xD0C0;&#xAE43; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC120;&#xC815;&#xACFC; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD55C; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;-KMPlayer"><a href="#&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;-KMPlayer" class="headerlink" title="&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0; - KMPlayer"></a>&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0; - KMPlayer</h1><p>&#xC81C;&#xAC00; &#xC608;&#xC2DC;&#xB85C; &#xB4E4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; KMPlayer&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB4E4; KMPlayer &#xC544;&#xC2DC;&#xC8E0;?? &#xC4F0;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xB3C4; &#xC788;&#xC744; &#xAC70;&#xACE0;</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image0.jpg" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98; : &#xB124;&#xC774;&#xBC84; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC790;&#xB8CC;&#xC2E4;</p>
</blockquote>
<p>KMPlayer&#xC758; &#xACBD;&#xC6B0; &#xC6D0;&#xB798;&#xB294; &#xB3D9;&#xC601;&#xC0C1; &#xD50C;&#xB808;&#xC774;&#xC5B4;&#xC774;&#xC9C0;&#xB9CC; &#xC74C;&#xC545;&#xB3C4; &#xD50C;&#xB808;&#xC774;&#xD574;&#xC8FC;&#xACE0; &#xC0AC;&#xC9C4;&#xB3C4; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xCC3E;&#xC558;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC0AC;&#xC9C4; &#xD3EC;&#xB9F7; &#xC911; &#xD558;&#xB098;&#xC778; .dib &#xD3EC;&#xB9F7;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; &#xD799; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;. &#xC62C;&#xD574;(2017&#xB144;) 4 &#xC6D4;&#xC778;&#xAC00; &#xC81C;&#xBCF4;&#xD558;&#xACE0; 7 &#xC6D4;&#xC5D0; &#xD328;&#xCE58;&#xAC00; &#xB418;&#xC5C8;&#xB124;&#xC694;.</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image1.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC124;&#xBA85;&#xC744; &#xD558;&#xB294; &#xC774;&#xC720;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>dib &#xD3EC;&#xB9F7;&#xC740; &#xC555;&#xCD95;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xADF8;&#xB0E5; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xB97C; raw &#xD558;&#xAC8C; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBD84;&#xC11D;&#xC744; &#xD560; &#xB54C;&#xB098; &#xC775;&#xC2A4;&#xB97C; &#xD560; &#xB54C;&#xB098; &#xC544;&#xC8FC; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC785;&#xBB38;&#xC790;&#xBD84;&#xB4E4;&#xC774; &#xCC98;&#xC74C; &#xACF5;&#xBD80;&#xB97C; &#xD560; &#xB54C; &#xB9E4;&#xC6B0; &#xC27D;&#xAC8C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xBD84;&#xC11D;&#xD560; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xAC00; &#xC791;&#xACE0; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xB2E8;&#xC21C;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xBBA4;&#xD14C;&#xC774;&#xD2B8; &#xD574;&#xC57C; &#xD560; &#xBC14;&#xC774;&#xD2B8;&#xB3C4; &#xC801;&#xACE0;&#xC694;. &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC26C;&#xC6CC;&#xC11C;??</li>
<li>KMPlayer&#xB294; &#xC608;&#xC804; &#xBC84;&#xC804;&#xC744; &#xB2E4;&#xC6B4; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB978; &#xAC74; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC544;&#xB3C4; &#xD658;&#xACBD; &#xAD6C;&#xC131;&#xC774; &#xC548;&#xB418;&#xBA74; &#xC774;&#xB7F0; &#xAE00;&#xC744; &#xC4F8; &#xC218;&#xAC00; &#xC5C6;&#xC5B4;&#xC694; &#x3160;&#x3160; </li>
</ol>
<p>&#xADF8;&#xB798;&#xC11C; &#xC774;&#xC81C; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xC8E0; &#x314B;&#x314B;&#x314B; &#xC77C;&#xB2E8; &#xBA3C;&#xC800; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xBC84;&#xC804;&#xC744; &#xB2E4;&#xC6B4; &#xBC1B;&#xC544; &#xBCF4;&#xC8E0;.</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xC81C;&#xAC00; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xC9C4;&#xD589;&#xD588;&#xB358; &#xBC84;&#xC804;&#xC740; 4.1.5.8&#xC785;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; 4.2.1.4 &#xC774;&#xC804; &#xBC84;&#xC804; &#xC544;&#xBB34;&#xAC70;&#xB098; &#xB2E4;&#xC6B4; &#xBC1B;&#xC73C;&#xC154;&#xB3C4; &#xB418;&#xB294; &#xB370; &#xC81C;&#xAC00; &#xCC3E;&#xC544; &#xB193;&#xC740; &#xAC00;&#xC82F;&#xC774;&#xB098; &#xC815;&#xBCF4;&#xB4E4;&#xC774; &#xB2E4; &#xC800; &#xBC84;&#xC804;&#xC774;&#xC5B4;&#xC11C; &#xC775;&#xC2A4; &#xB2E4;&#xC2DC; &#xC9DC;&#xAE30; &#xADC0;&#xCC2E;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xADF8;&#xB0E5; &#xC774; &#xBC84;&#xC804;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xC81C; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4; &#xAC74;&#xB370; &#xB9CC;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xB72F;&#xC5B4;&#xBCF4;&#xBA74;&#xC11C; dib &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAC04;&#xB2E8;&#xD788; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;. </p>
<p>&#xC55E;&#xC11C; &#xB9D0;&#xD588;&#xB2E4;&#xC2DC;&#xD53C; dib &#xD3EC;&#xB9F7;&#xC740; &#xBB34;&#xC555;&#xCD95; &#xBE44;&#xD2B8;&#xB9F5; &#xC774;&#xBBF8;&#xC9C0; &#xD3EC;&#xB9F7;&#xC785;&#xB2C8;&#xB2E4;. &#xAD6C;&#xC870;&#xAC00; &#xB9E4;&#xC6B0; &#xAC04;&#xB2E8;&#xD558;&#xACE0; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xB4E4;&#xC774; &#xC5B4;&#xB5A0;&#xD55C; &#xAC00;&#xACF5;&#xB3C4; &#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xBC14;&#xB85C; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC8E0;. (&#xC555;&#xCD95;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xC788;&#xAE30;&#xB294; &#xD574;&#xC694; &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB0E5; &#xB118;&#xC5B4;&#xAC08;&#xAC8C;&#xC5EC;) </p>
<p>&#xD3EC;&#xB9F7;&#xC740; &#xB450; &#xAC1C;&#xC758; &#xAD6C;&#xC870;&#xCCB4;&#xC640; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCFC;&#xAC8C;&#xC694;. &#xAC1C;&#xAFC0;&#xC778; &#xAC8C; &#xC708;&#xB3C4;&#xC6B0;&#xC5D0; &#xAE30;&#xBCF8;&#xC73C;&#xB85C; &#xC788;&#xB294; &#xADF8;&#xB9BC;&#xD310;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; dib &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; 24 &#xBE44;&#xD2B8; &#xBE44;&#xD2B8;&#xB9F5;&#xC758; dib &#xD3EC;&#xB9F7;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;. 24 &#xBE44;&#xD2B8;&#xC778; &#xC774;&#xC720;&#xB294; RGB&#xB97C; &#xD45C;&#xD604;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xD55C; &#xD53D;&#xC140;&#xC744; &#xD45C;&#xD604;&#xD558;&#xB294; &#xB370; 3 &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xAC8C; &#xBA3C;&#xC800; &#xC800;&#xC7A5;&#xC744; &#xD558;&#xACE0; &#xC544;&#xBB34; &#xC0C9;&#xC774;&#xB098; &#xB123;&#xC5B4;&#xBCFC;&#xAC8C;&#xC694;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#xC800;&#xC7A5;&#xD558;&#xACE0; hxd&#xB85C; &#xBD05;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xADF8;&#xB0E5; &#xD68C;&#xC0C9;&#xC73C;&#xB85C; &#xCE60;&#xD574;&#xBCF4;&#xC558;&#xB294; &#xB370; &#xD5E5;&#xC2A4;&#xB85C; &#xBCF4;&#xB2C8;&#xAE4C; &#xC544;&#xB798;&#xCC98;&#xB7FC; &#xB098;&#xC624;&#xB124;&#xC694;.</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image4.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xC74C; &#xB531; &#xBD10;&#xB3C4; &#xC704;&#xC5D0; &#xBE68;&#xAC04; &#xBD80;&#xBD84;&#xC774; &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xC774;&#xACE0; &#xB4A4;&#xC5D0;&#xC11C; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xC778; &#xAC70; &#xAC19;&#xC8E0;?? &#xC774;&#xB807;&#xAC8C;<br>&#xAC04;&#xB2E8;&#xD55C; &#xD3EC;&#xB9F7; &#xCC98;&#xC74C; &#xBCF4;&#xB294; &#xAC70; &#xAC19;&#xC8E0;?? &#x3147;&#x3148;? &#x3147;&#x3147;&#x3148;</p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xBE68;&#xAC04;&#xC0C9; &#xBC15;&#xC2A4; &#xBD80;&#xBD84;&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xBB54;&#xC9C0; &#xAC04;&#xB2E8;&#xD558;&#xAC8C;&#xB9CC; &#xC54C;&#xC544;&#xBCFC;&#xAC8C;&#xC694;. &#xCC38;&#xACE0;&#xB85C; &#xB2E4;&#xB978; &#xD3EC;&#xB9F7;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xD560; &#xB54C;&#xC5D0;&#xB3C4; &#xD3EC;&#xB9F7;&#xC744; &#xC54C;&#xACE0; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xAC8C; &#xC880; &#xB354; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC9C4;&#xD589;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC774; &#xC5B4;&#xB5A4; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; &#xC9C0; &#xADF8;&#xB798;&#xC11C; &#xC6B0;&#xB9AC;&#xAC00; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC5D0; &#xC5B4;&#xB5BB;&#xAC8C; &#xD65C;&#xC6A9;&#xC744; &#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xC8E0;. &#xD655;&#xC2E4;&#xD788; &#xB9AC;&#xBC84;&#xC2F1; &#xC18D;&#xB3C4;&#xB97C; &#xD5A5;&#xC0C1;&#xC2DC;&#xCF1C; &#xC8FC;&#xAE30;&#xB294; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; &#xCCAB; &#xBC88;&#xC9F8; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xBCF4;&#xBA74;</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB807;&#xAC8C; &#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8;&#xB294; &#xB2F9;&#xC5F0;&#xD788; &#xD5E4;&#xB354;&#xAC00; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xACE0; &#xB4A4;&#xC5D0; &#xD30C;&#xC77C;&#xC758; &#xC804;&#xCCB4; &#xC0AC;&#xC774;&#xC988; &#xADF8;&#xB9AC;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC740; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xAC00; &#xC2DC;&#xC791;&#xB418;&#xB294; &#xC624;&#xD504;&#xC14B;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xB450; &#xBC88;&#xC9F8; &#xC624;&#xD504;&#xC14B;&#xC744; &#xBCFC;&#xAC8C;&#xC5EC;</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image6.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBBF8;&#xC9C0;&#xC758; &#xAC00;&#xB85C; &#xC138;&#xB85C; &#xAE38;&#xC774;, &#xD574;&#xC0C1;&#xB3C4;, &#xC555;&#xCD95; &#xC5EC;&#xBD80; &#xB4F1;&#xB4F1;&#xC774; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xAD6C;&#xC870;&#xCCB4;&#xB294; &#xC880; &#xB354; &#xB9CE;&#xB124;&#xC694;? &#xC704; &#xAD6C;&#xC870;&#xCCB4;&#xB294; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB370;&#xB9CC; &#xC4F0;&#xC774;&#xACE0; &#xC2E4;&#xC81C; &#xCD9C;&#xB825;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xC544;&#xB798; &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xB531;&#xD788; &#xC775;&#xC2A4;&#xC5D0;&#xB294; &#xB3C4;&#xC6C0;&#xC774; &#xC548; &#xB418;&#xB2C8; &#xADF8;&#xB0E5; &#xC774;&#xC815;&#xB3C4;&#xB9CC; &#xC54C;&#xACE0; &#xD544;&#xC694;&#xD55C; &#xAC70;&#xB294; &#xB4A4;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;. &#xB354; &#xC54C;&#xACE0; &#xC2F6;&#xC740; &#xBD84;&#xC740; &#xC544;&#xB798; &#xB9C1;&#xD06C;&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB420; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="http://www.soulfree.net/186">http://www.soulfree.net/186</a></p>
<p>&#xC774;&#xC81C; &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB4E4;&#xB3C4; &#xC54C;&#xC558;&#xACE0; &#xD37C;&#xC800;&#xC5D0; &#xB3CC;&#xB824;&#xBCFC; &#xAC74;&#xB370; &#xD37C;&#xC800;&#xB97C; &#xB3CC;&#xB9AC;&#xAE30; &#xC804;&#xC5D0; &#xBD84;&#xC11D;&#xC744; &#xC880; &#xB354; &#xD3B8;&#xD558;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC800;&#xB9CC;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB123;&#xC744; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image7.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xAC00; &#xB4E4;&#xC5B4;&#xC788;&#xB294; &#xBD80;&#xBD84;&#xC758; &#xC55E;&#xBD80;&#xBD84;&#xC744; &#xC81C; &#xB2C9;&#xB124;&#xC784;&#xC73C;&#xB85C; &#xBC14;&#xAFB8;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xB098;&#xC911;&#xC5D0; &#xD06C;&#xB798;&#xC2DC; &#xBD84;&#xC11D;&#xC744; &#xD560; &#xB54C; &#xB0B4; &#xD30C;&#xC77C;&#xC774; &#xC5B4;&#xB514;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xB294; &#xC5C6;&#xC744; &#xBC95;&#xD55C; &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xCC44;&#xC6CC;&#xC8FC;&#xB294; &#xAC8C; &#xC88B;&#xC8E0;. AAAA &#xB098; BBBB &#xC774;&#xB7F0; &#xAC70;&#xB294; &#xB2E8;&#xC21C;&#xD574;&#xC11C; &#xB2E4;&#xB978; &#xC4F0;&#xB808;&#xAE30; &#xB370;&#xC774;&#xD130;&#xC5D0;&#xB3C4; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC800;&#xB294; &#xC81C; &#xB2C9;&#xB124;&#xC784;&#xC744; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD3B8;&#xC785;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xD30C;&#xC77C; &#xB9E8; &#xB4A4;&#xC5D0;&#xB3C4; &#xBE44;&#xC2B7;&#xD558;&#xAC8C; &#xB123;&#xC5B4;&#xC8FC;&#xBA74; &#xB05D;&#xAE4C;&#xC9C0; &#xB2E4; &#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB294; &#xC9C0;&#xB3C4; &#xC54C; &#xC218; &#xC788;&#xACA0;&#xC8E0;? &#xC774;&#xB807;&#xAC8C; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; &#xD37C;&#xC800;&#xB97C; &#xB3CC;&#xB9AC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. </p>
<p>&#xB450; &#xD30C;&#xD2B8;&#xC5D0; &#xAC70;&#xCCD0; &#xC6CC;&#xBC0D;&#xC5C5;&#xC774; &#xB9C8;&#xBB34;&#xB9AC; &#xB410;&#xB124;&#xC694;..! &#xB124; &#xC774;&#xC81C; &#xC2DC;&#xC791;&#xC774;&#xB77C;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;</p>
<p>&#xB2E4;&#xC74C; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xD37C;&#xC800;&#xC758; &#xD06C;&#xB798;&#xC2DC; &#xC815;&#xBCF4;&#xB97C; &#xD1B5;&#xD574; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD574;&#xBCFC; &#xAC74;&#xB370;&#xC694;. &#xBCF8;&#xACA9;&#xC801;&#xC778; &#xC0BD;&#xC9C8;&#xC5D0; &#xC8FC;&#xC758;&#xD574;&#xC8FC;&#xC2DC;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4; &#x314E;&#x314E; &#xADF8;&#xB7FC; Part 3&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h2 id="Part-3-&#xC608;&#xACE0;"><a href="#Part-3-&#xC608;&#xACE0;" class="headerlink" title="Part 3 &#xC608;&#xACE0;"></a>Part 3 &#xC608;&#xACE0;</h2><p><img src="/2021/03/17/l0ch/bughunting-tutorials-part2/image8.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xACE0;&#xC0DD;&#xC740; &#xC774;&#xC81C;&#xBD80;&#xD130; &#xC2DC;&#xC791;..</p>
</blockquote>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-hunting/">bug hunting</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/03/18/idioth/2021-03-18/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] Yealink DM Pre-Auth root level RCE</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/03/17/fabu1ous/2021-03-17/">
                    <span class="hidden-mobile">[하루한줄]VoIPmonitor BoF to RCE</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/';
        this.page.identifier = '/2021/03/17/l0ch/bughunting-tutorials-part2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 버그헌팅 튜토리얼 Part 2&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
