

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">

  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Measured Boot와 멀웨어 시그니처: Windows Loader에서 발견된 두 가지 취약점 - hackyboiz">
  <meta property="og:description" content="hack &amp; life">
  <meta property="og:image" content="/img/favicon.ico">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/06/27/l0ch/measured-boot-vuln/">

  <title>[Translation] Measured Boot와 멀웨어 시그니처: Windows Loader에서 발견된 두 가지 취약점 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>

<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-06-27 18:00" pubdate>
      2021년 6월 27일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      9.8k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      195
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Measured Boot와 멀웨어 시그니처: Windows Loader에서 발견된 두 가지 취약점</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; L0ch&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC624;&#xB298;&#xC740; Windows Kernel &#xBC0F; Loader&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810; &#xB450; &#xAC1C;&#xB97C; &#xB4E4;&#xACE0; &#xC654;&#xB294;&#xB370;&#xC694;, &#xC6D0;&#xB798;&#xB294; &#xD558;&#xB8E8;&#xD55C;&#xC904;&#xB85C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xD558;&#xB824;&#xB2E4; &#xC811;&#xD560; &#xAE30;&#xD68C;&#xAC00; &#xB9CE;&#xC774; &#xC5C6;&#xB294; Boot Security&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85; &#xB4F1; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC774;&#xD574;&#xB97C; &#xB3D5;&#xAE30; &#xC704;&#xD55C; &#xB0B4;&#xC6A9;&#xC774; &#xC798; &#xC815;&#xB9AC;&#xB418;&#xC5B4; &#xC788;&#xB354;&#xB77C;&#xAD6C;&#xC694;. &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xC7AC;&#xBC0C;&#xAC8C; &#xC77D;&#xC5B4;&#xC11C; &#xC815;&#xB9AC;&#xB3C4; &#xD560; &#xACB8; &#xBC88;&#xC5ED;&#xAE00;&#xB85C; &#xB0A8;&#xACA8;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC624;&#xC5ED;&#xACFC; &#xC758;&#xC5ED;&#xB369;&#xC5B4;&#xB9AC; &#xBC88;&#xC5ED;&#xAE00;&#xC774;&#xB2C8; &#xC9C0;&#xC801;&#xC740; &#xB9E4;&#xC6B0; &#xD658;&#xC601;&#xC774;&#xC5D0;&#xC694;..!</p>
<blockquote>
<p>&#xC6D0;&#xBB38; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://bi-zone.medium.com/measured-boot-and-malware-signatures-exploring-two-vulnerabilities-found-in-the-windows-loader-5a4fcc3c4b66">Measured Boot and Malware Signatures: exploring two vulnerabilities found in the Windows loader</a></p>
</blockquote>
<hr>
<h1 id="Introduction-to-Boot-Security"><a href="#Introduction-to-Boot-Security" class="headerlink" title="Introduction to Boot Security"></a>Introduction to Boot Security</h1><p>Boot Security&#xC5D0;&#xB294; Verified Boot&#xC640; Measured Boot&#xB77C;&#xB294; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xAC1C;&#xB150;&#xC774; &#xC788;&#xB2E4;.</p>
<h2 id="Verified-Boot"><a href="#Verified-Boot" class="headerlink" title="Verified Boot"></a>Verified Boot</h2><p>Verified Boot &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xB514;&#xC9C0;&#xD138; &#xC11C;&#xBA85;&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xC740; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xAC00; &#xBD80;&#xD305; &#xC911;&#xC5D0; &#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;. &#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC11C;&#xBA85;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xAC70;&#xB098; &#xC81C;&#xB300;&#xB85C; &#xC11C;&#xBA85;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBD80;&#xD305; &#xAD6C;&#xC131; &#xC694;&#xC18C; (&#xC608; : &#xBD80;&#xD305; &#xAD00;&#xB9AC;&#xC790; &#xBC0F; &#xD38C;&#xC6E8;&#xC5B4; &#xB4DC;&#xB77C;&#xC774;&#xBC84;)&#xAC00; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xAC83;&#xC744; &#xCC28;&#xB2E8;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC778; Secure Boot&#xB85C; &#xAD6C;&#xD604;&#xB41C;&#xB2E4;.</p>
<h2 id="Measured-Boot"><a href="#Measured-Boot" class="headerlink" title="Measured Boot"></a>Measured Boot</h2><p>Measured Boot &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xBD80;&#xD305; &#xC911; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC804; &#xBAA8;&#xB4E0; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB97C; &#xAE30;&#xB85D;&#xD55C;&#xB2E4;. &#xC774;&#xB294; &#xBCC0;&#xC870; &#xBC29;&#xC9C0; &#xBC29;&#xC2DD;(tamper-proof way)&#xC73C;&#xB85C; &#xC720;&#xC9C0;&#xB418;&#xBA70; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xD50C;&#xB7AB;&#xD3FC; &#xBAA8;&#xB4C8; (Trusted Platform Module, TPM)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAD6C;&#xD604;&#xB41C;&#xB2E4;. TPM&#xC740; &#xD38C;&#xC6E8;&#xC5B4; &#xBC0F; &#xC911;&#xC694; &#xC6B4;&#xC601; &#xCCB4;&#xC81C; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC758; &#xD574;&#xC2DC;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC5B4; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD574;&#xC2DC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBC29;&#xC9C0;&#xD55C;&#xB2E4;. </p>
<p>Verified Boot&#xC640; Measured Boot&#xB294; &#xB3D9;&#xC2DC;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xAC1C;&#xB150;&#xACFC; Windows&#xC5D0;&#xC11C;&#xC758; &#xAD6C;&#xD604;&#xC5D0; &#xB300;&#xD55C; &#xAE30;&#xC220;&#xC801; &#xC138;&#xBD80; &#xC0AC;&#xD56D;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://edk2-docs.gitbook.io/understanding-the-uefi-secure-boot-chain/overview">Reference [1]</a>&#xACFC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows/security/information-protection/secure-the-windows-10-boot-process">Reference [2]</a>&#xC5D0;&#xC11C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xC704; &#xB450; &#xAC00;&#xC9C0; &#xC774;&#xC678;&#xC5D0;&#xB3C4; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xB124; &#xAC00;&#xC9C0;&#xC758; &#xAC1C;&#xB150;&#xC774; &#xC788;&#xB2E4;.</p>
<ul>
<li>Post-boot verification - &#xBD80;&#xD305; &#xC774;&#xD6C4; &#xD655;&#xC778;</li>
<li>Booting from read-only media - &#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBBF8;&#xB514;&#xC5B4;&#xC5D0;&#xC11C; &#xBD80;&#xD305;</li>
<li>Booting from a read-only volume(image) - &#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBCFC;&#xB968;(&#xC774;&#xBBF8;&#xC9C0;)&#xC5D0;&#xC11C; &#xBD80;&#xD305;</li>
<li>pre-boot verification - &#xBD80;&#xD305; &#xC804; &#xD655;&#xC778;</li>
</ul>
<h2 id="Post-boot-verification"><a href="#Post-boot-verification" class="headerlink" title="Post-boot verification"></a>Post-boot verification</h2><p>Post-boot verification&#xC740; &#xBD80;&#xD305; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC644;&#xB8CC;&#xB41C; &#xC774;&#xD6C4; &#xB610;&#xB294; &#xD6C4;&#xBC18; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xB41C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC758;&#xD574; &#xC218;&#xD589;&#xB41C;&#xB2E4;. &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC774;&#xC804;&#xC5D0; &#xC2E4;&#xD589;&#xB41C; OS &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xC640; &#xB370;&#xC774;&#xD130;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xD655;&#xC778;&#xD55C;&#xB2E4;. &#xC774; &#xBC29;&#xC2DD;&#xC740; &#xB354; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589; &#xC911;&#xC778; &#xBA40;&#xC6E8;&#xC5B4;&#xC758; &#xACBD;&#xC6B0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD30C;&#xC77C; &#xC77D;&#xAE30; &#xC694;&#xCCAD;&#xC744; &#xAC00;&#xB85C;&#xCC44;&#xACE0; &#xBC18;&#xD658;&#xB418;&#xB294; &#xD30C;&#xC77C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC81C;&#xC5B4;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC6B0;&#xD68C;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xB098; &#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;, &#xC5D4;&#xB4DC;&#xD3EC;&#xC778;&#xD2B8; &#xD0D0;&#xC9C0; &#xBC0F; &#xB300;&#xC751; &#xC194;&#xB8E8;&#xC158;&#xACFC; &#xC554;&#xD638;&#xD654; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC758; &#xBBF8;&#xD2F0;&#xAC8C;&#xC774;&#xC158;&#xC73C;&#xB85C;&#xC368; &#xC0AC;&#xC6A9;&#xD560; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB2E4;.</p>
<h2 id="Booting-from-read-only-media"><a href="#Booting-from-read-only-media" class="headerlink" title="Booting from read-only media"></a>Booting from read-only media</h2><p>&#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBBF8;&#xB514;&#xC5B4;&#xC5D0;&#xC11C; &#xBD80;&#xD305;&#xD558;&#xB294; &#xAC83;&#xC740; BIOS &#xBC0F; UEFI&#xC640; &#xAC19;&#xC740; OS &#xC2DC;&#xC791; &#xC804; &#xD658;&#xACBD;(pre-OS environment)&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xAC1C;&#xB150;&#xC774; &#xC801;&#xC6A9;&#xB41C; &#xC628;&#xB77C;&#xC778; &#xBC45;&#xD0B9;&#xC744; &#xC704;&#xD55C; &#xC2E4;&#xC2DC;&#xAC04; &#xBC30;&#xD3EC; &#xBC29;&#xC2DD;&#xC740; &#xC774;&#xBBF8; &#xC218;&#xB144; &#xC804;&#xC5D0; <a target="_blank" rel="external nofollow noopener noreferrer" href="http://thinkinghard.com/secureinternetbanking/index.html">&#xC81C;&#xC548;&#xB418;&#xC5C8;&#xC73C;&#xBA70;</a> &#xD604;&#xC7AC;&#xB294; &#xC7AC;&#xD0DD;&#xADFC;&#xBB34; &#xC2DC; &#xBCF4;&#xC548;&#xC744; &#xC704;&#xD574; &#xC81C;&#xC548;&#xB418;&#xAE30;&#xB3C4; &#xD55C;&#xB2E4;. &#xC774;&#xB294; &#xAE30;&#xC874;&#xC758; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xBA40;&#xC6E8;&#xC5B4;&#xC5D0; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xB300;&#xC751;&#xD574; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xBA40;&#xC6E8;&#xC5B4;&#xB85C;&#xBD80;&#xD130; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xBCF4;&#xD638;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; OS &#xC774;&#xC804; &#xD658;&#xACBD;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA74; &#xC6B0;&#xD68C;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;. &#xC774;&#xB3D9;&#xC2DD; &#xBBF8;&#xB514;&#xC5B4;&#xC5D0;&#xC11C; &#xBD80;&#xD305;&#xB418;&#xB294; OS&#xB97C; &#xC18D;&#xC5EC; &#xAE30;&#xC874; &#xBBF8;&#xB514;&#xC5B4;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xB294; BIOS &#xB610;&#xB294; UEFI&#xAC00; &#xBD80;&#xD305; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC744; &#xB54C; &#xAE30;&#xBCF8; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C; &#xC804;&#xD658;&#xD558;&#xB294; &#xB3D9;&#xC548; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xAD00;&#xB828;&#xB41C; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xC774;&#xC288;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://dfir.ru/2018/07/21/a-live-forensic-distribution-executing-malicious-code-from-a-suspect-drive/">&#xC774;&#xC804; &#xAE00;&#xC5D0;&#xC11C;</a> &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h2 id="Booting-from-a-read-only-volume"><a href="#Booting-from-a-read-only-volume" class="headerlink" title="Booting from a read-only volume"></a>Booting from a read-only volume</h2><p>&#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBCFC;&#xB968;(&#xC774;&#xBBF8;&#xC9C0;)&#xC5D0;&#xC11C; &#xBD80;&#xD305;&#xD558;&#xB294; &#xAC83; &#xB610;&#xD55C; &#xBE44;&#xC2B7;&#xD55C; &#xAC1C;&#xB150;&#xC774;&#xC9C0;&#xB9CC; &#xBCC0;&#xACBD; &#xBD88;&#xAC00;&#xB2A5;&#xD55C; OS &#xD30C;&#xC77C;&#xB9CC; &#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBCFC;&#xB968;&#xC5D0; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;. &#xC774; &#xBCFC;&#xB968;&#xC740; &#xD574;&#xC2DC; &#xB610;&#xB294; &#xD574;&#xC2DC; &#xD2B8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xAC80;&#xC99D;&#xD55C;&#xB2E4;. &#xD574;&#xC2DC; &#xB610;&#xB294; &#xD574;&#xC2DC; &#xD2B8;&#xB9AC;&#xC758; &#xB8E8;&#xD2B8; &#xD574;&#xC2DC;&#xB294; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB85C; &#xBCF4;&#xD638;&#xB418;&#xB294; &#xB8E8;&#xD2B8;&#xC5D0; &#xC758;&#xD574; &#xC11C;&#xBA85;&#xB418;&#xACE0; &#xAC80;&#xC99D;&#xB418;&#xBA70; &#xC774; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC740; &#xAE30;&#xC874;&#xC758; &#xAC80;&#xC99D;&#xB41C; &#xBD80;&#xD305; &#xAD6C;&#xD604;&#xACFC; &#xAD00;&#xB828;&#xC774; &#xC788;&#xB2E4;. &#xB354; &#xC790;&#xC138;&#xD55C; &#xAE30;&#xC220; &#xC815;&#xBCF4;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://source.android.com/security/verifiedboot/verified-boot">&#xC5EC;&#xAE30;</a>&#xC11C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB2E4;.</p>
<h2 id="Pre-boot-verification"><a href="#Pre-boot-verification" class="headerlink" title="Pre-boot verification"></a>Pre-boot verification</h2><p>Pre-boot verification&#xC740; &#xC798; &#xC54C;&#xB824;&#xC9C0;&#xC9C0; &#xC54A;&#xC740; &#xAE30;&#xC220;&#xC774;&#xBA70; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; PCI (Peripheral Component Interconnect) &#xC7A5;&#xCE58; &#xB610;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; UEFI &#xC774;&#xBBF8;&#xC9C0;&#xB85C; &#xAD6C;&#xD604;&#xB41C;&#xB2E4;. &#xBD80;&#xD305; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0; &#xC788;&#xB294; &#xBD80;&#xD2B8; &#xB85C;&#xB354;&#xB97C; &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xD655;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xAD6C;&#xC131;, &#xB178;&#xCD9C;&#xB41C; &#xD38C;&#xC6E8;&#xC5B4; &#xBA54;&#xBAA8;&#xB9AC;, &#xC2E4;&#xD589; &#xD30C;&#xC77C; &#xBC0F; &#xAE30;&#xD0C0; &#xB370;&#xC774;&#xD130; (&#xC608; : Windows Installation&#xC758; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xAC12;) &#xB4F1;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xD655;&#xC778;&#xD55C;&#xB2E4;. </p>
<p>Pre-boot verification&#xC740; &#xC774;&#xC804;&#xC5D0;&#xB294; &#xCD08;&#xAE30;&#xD654; &#xCF54;&#xB4DC;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBA54;&#xBAA8;&#xB9AC; (option ROM)&#xAC00; &#xC788;&#xB294; PCI &#xC7A5;&#xCE58;&#xB85C; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xB2E4;. &#xCD08;&#xAE30;&#xD654; &#xCF54;&#xB4DC;&#xB294; &#xBD80;&#xD2B8; &#xB85C;&#xB354;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xBA85;&#xB839;&#xC5B4; &#xC704;&#xCE58;&#xC5D0; &#xC911;&#xB2E8;&#xC810;&#xC744; &#xC124;&#xCE58;&#xD574; &#xC911;&#xB2E8;&#xC810;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74; PCI &#xC7A5;&#xCE58;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; OS&#xAC00; &#xC2DC;&#xC791;&#xB418;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838; &#xC788;&#xB2E4;. OS&#xB294; &#xC5F0;&#xACB0;&#xB41C; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0;&#xC11C; &#xCC3E;&#xC740; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xACE0; &#xD655;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294;&#xB370;, &#xC774;&#xB54C; &#xD574;&#xC2DC;&#xB294; &#xBB34;&#xACB0;&#xC131;&#xC774; &#xD655;&#xC778;&#xB41C; &#xC2DC;&#xC2A4;&#xD15C; &#xB4DC;&#xB77C;&#xC774;&#xBE0C; &#xB610;&#xB294; PCI &#xC7A5;&#xCE58;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA70; &#xAC80;&#xC99D;&#xC5D0; &#xC131;&#xACF5;&#xD558;&#xBA74; &#xC6D0;&#xB798; &#xBD80;&#xD2B8; &#xB85C;&#xB354;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xAC00; &#xC2DC;&#xC791;&#xB41C;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC;&#xB294; PCI &#xC7A5;&#xCE58;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; UEFI &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xBA54;&#xC778;&#xBCF4;&#xB4DC;&#xC5D0; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; UEFI &#xC774;&#xBBF8;&#xC9C0;&#xC5D0;&#xB294; &#xD655;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xD30C;&#xC11C;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; USB &#xBD80;&#xD305;&#xC744; &#xC704;&#xD574; USB &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD55C; &#xAD6C;&#xD604;&#xB3C4; &#xC788;&#xB2E4;. &#xC774;&#xC804; &#xBC29;&#xC2DD;&#xACFC; &#xBE44;&#xAD50;&#xD574; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBD80;&#xD305; &#xC21C;&#xC11C;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xAC00;&#xC815;&#xD558;&#xC5D0; BIOS / UEFI &#xD658;&#xACBD;&#xC5D0; &#xB300;&#xD55C; &#xC911;&#xB2E8;&#xC810; &#xB610;&#xB294; &#xC560;&#xB4DC;&#xC628;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBD80;&#xD305; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xAC04;&#xC12D;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB2E4;.</p>
<p>&#xC774; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC740; BIOS &#xBC0F; UEFI&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xD38C;&#xC6E8;&#xC5B4;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xC81C;&#xD55C;&#xB418;&#xC9C0;&#xB9CC;, &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; UEFI &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC124;&#xACC4;&#xC0C1; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xC601;&#xC5ED;&#xC5D0; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;.</p>
<p>&#xB610; &#xB2E4;&#xB978; &#xB2E8;&#xC810;&#xC740; &#xACF5;&#xC2DD; Windows&#xC5D0;&#xC11C; &#xAD6C;&#xD604;&#xB41C; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xBC0F; Windows &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC2F1; &#xCF54;&#xB4DC;&#xB97C; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC70;&#xC758; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; Linux &#xC0AC;&#xC6A9;&#xC790;&#xAC00; NTFS &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xB9C8;&#xC6B4;&#xD2B8; &#xD558;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xD0D0;&#xC0C9;&#xD558;&#xB294; Windows &#xC0AC;&#xC6A9;&#xC790;&#xC640; &#xB3D9;&#xC77C;&#xD55C; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xB808;&#xC774;&#xC544;&#xC6C3;&#xACFC; &#xD30C;&#xC77C; &#xB0B4;&#xC6A9;&#xC774; &#xD45C;&#xC2DC;&#xB41C;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; Pre-boot verification&#xC740; &#xC2E4;&#xC81C;&#xB85C; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC6D0;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xB294; &#xB3D9;&#xC77C;&#xD558;&#xB098; &#xB2E4;&#xB978; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBC18;&#xD658;&#xD560; &#xC218; &#xC788;&#xB2E4;. </p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xB300;&#xBD80;&#xBD84;&#xC758; Pre-boot verification &#xC81C;&#xD488;&#xC740; Windows &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xB85C;&#xADF8; &#xD30C;&#xC77C;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xC989;, Kernel &#xC218;&#xC900;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xBA40;&#xC6E8;&#xC5B4;&#xAC00; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xAC12;&#xC744; &#xC218;&#xC815;&#xD574; Pre-boot verification&#xC5D0;&#xC11C; &#xC784;&#xC758;&#xC758; &#xAC12;&#xC744; &#xAC00;&#xC838;&#xC624;&#xB3C4;&#xB85D; &#xD560; &#xC218; &#xC788;&#xB2E4;. Windows Kernel&#xC740; &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xB85C;&#xADF8; &#xD30C;&#xC77C;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xBBC0;&#xB85C; &#xC774;&#xB7EC;&#xD55C; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC740; &#xBD80;&#xD305; &#xB3C4;&#xC911;&#xACFC; &#xBD80;&#xD305; &#xD6C4;&#xC5D0; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xD45C;&#xC2DC;&#xB41C;&#xB2E4;. &#xC774;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://dfir.ru/2018/10/07/hiding-data-in-the-registry/">&#xC774;&#xC804; &#xAE00;&#xC5D0;&#xC11C;</a> &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xB418;&#xC5B4; &#xC788;&#xB2E4;.  </p>
<p>verified &#xBC0F; measured boot &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xCF54;&#xB4DC;&#xC640; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804; &#xAC80;&#xC99D;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC55E;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xACF5;&#xACA9;&#xC5D0; &#xB300;&#xD55C; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC73C;&#xB85C; &#xC608;&#xC0C1;&#xB41C;&#xB2E4;. &#xC2E4;&#xD589;&#xB420; &#xD30C;&#xC77C;&#xC774; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB978; &#xD574;&#xC2DC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xD30C;&#xC77C;&#xC774; verified &#xBC0F; measured&#xB97C; &#xAC70;&#xCCD0; &#xB3D9;&#xC77C;&#xD55C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBCF4;&#xC548;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774; &#xC811;&#xADFC; &#xBC29;&#xBC95; &#xB610;&#xD55C; &#xD56D;&#xC0C1; &#xC644;&#xBCBD;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xB2E4;. &#xC774; &#xAE00;&#xC5D0;&#xC11C;&#xB294; Windows Loader (<code>winload.exe</code> &#xB610;&#xB294; <code>winload.efi</code>)&#xC758; measured boot&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xB450; &#xAC00;&#xC9C0; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xC911;&#xC810;&#xC744; &#xB458; &#xAC83;&#xC774;&#xBA70;, &#xBCC4;&#xB3C4;&#xC758; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAD6C;&#xC131; &#xC694;&#xC18C;(&#xC774;&#xD6C4;&#xC5D0; &#xC124;&#xBA85;&#xD560; Loader&#xC640; kernel)&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xC640; &#xCF54;&#xB4DC;&#xB97C; &#xAC80;&#xC99D;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C;&#xC758; &#xC774;&#xC288;&#xC5D0; &#xB300;&#xD574; &#xAC15;&#xC870;&#xD55C;&#xB2E4;.</p>
<h1 id="Early-Launch-Anti-Malware"><a href="#Early-Launch-Anti-Malware" class="headerlink" title="Early Launch Anti-Malware"></a>Early Launch Anti-Malware</h1><p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; Windows Kernel (<code>ntoskrnl.exe</code>)&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF8;&#xB2E4;.</p>
<p>&#xB450; &#xAC00;&#xC9C0;&#xC758; &#xC8FC;&#xC694; &#xBD80;&#xD305; &#xBCF4;&#xC548;&#xC778;  verified boot&#xC640; measured boot&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xACE0; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;/&#xD38C;&#xC6E8;&#xC5B4; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xACE0;&#xB824;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0; &#xBA40;&#xC6E8;&#xC5B4;&#xC758; &#xCD08;&#xAE30; &#xBAA9;&#xD45C; &#xC0BD;&#xC785; &#xC9C0;&#xC810;&#xC740; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB2E4;.</p>
<p>&#xC545;&#xC131; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; Microsoft&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows-hardware/drivers/install/early-launch-antimalware">ELAM (Early Launch Anti-Malware) &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;</a>&#xB97C; Windows 8&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#xB3C4;&#xC785;&#xD588;&#xB2E4;. </p>
<p>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xB2E4;&#xB978; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xBCF4;&#xB2E4; &#xBA3C;&#xC800; &#xC2DC;&#xC791;&#xD574; &#xC885;&#xC18D;&#xC131;&#xACFC; &#xC720;&#xD6A8;&#xC131;&#xC744; &#xAC80;&#xC0AC;&#xD55C;&#xB2E4;. &#xAC01; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB300;&#xD574; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xB2E4;&#xC74C; &#xAC12;&#xC744; &#xBC18;&#xD658;&#xD55C;&#xB2E4;.</p>
<ul>
<li>unknown - &#xC54C; &#xC218; &#xC5C6;&#xC74C;</li>
<li>good - &#xC815;&#xC0C1;&#xC801;&#xC778; &#xB4DC;&#xB77C;&#xC774;&#xBC84;</li>
<li>bad - &#xC545;&#xC131; &#xB4DC;&#xB77C;&#xC774;&#xBC84;</li>
<li>bad but critical for the boot - &#xC545;&#xC131; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC9C0;&#xB9CC; &#xBD80;&#xD305; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xBE60;&#xC838;&#xC11C;&#xB294; &#xC548; &#xB420; &#xC694;&#xC18C;</li>
</ul>
<p>&#xB610;&#xD55C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xC218;&#xD589;&#xD558;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xC791;&#xC5C5;&#xC744; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xCF5C;&#xBC31;&#xC744; &#xC124;&#xC815;&#xD558;&#xACE0; &#xB7F0;&#xD0C0;&#xC784; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4;&#xC758; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC5D0; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xC790;&#xCCB4; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; Windows 8.1&#xC5D0;&#xC11C; &#xB3C4;&#xC785;&#xB41C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows/win32/services/protecting-anti-malware-services-">&#xCF54;&#xB4DC; &#xBB34;&#xACB0;&#xC131; &#xBCF4;&#xD638;</a>&#xAC00; &#xC81C;&#xACF5;&#xB418;&#xC5B4; &#xBCF4;&#xD638;&#xB41C; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;. </p>
<p>&#xBD80;&#xD305; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC911;&#xC5D0; &#xB458; &#xC774;&#xC0C1;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xAC01; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC9C0;&#xC815;&#xB41C; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD558;&#xBA70; &#xC774; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xCD5C;&#xC885; &#xACB0;&#xACFC;&#xAC12;&#xC740; &#xB2E4;&#xC74C; &#xC21C;&#xC704;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD55C;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled.png"></p>
<blockquote>
<p>Table 1. ELAM scores (ranks)</p>
</blockquote>
<p>&#xD55C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; <code>good</code> &#xC744; &#xBC18;&#xD658;&#xD558;&#xACE0; &#xB2E4;&#xB978; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; <code>bad</code>&#xB97C; &#xBC18;&#xD658;&#xD558;&#xBA74; &#xC774; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; <code>bad</code>&#xB85C; &#xACB0;&#xC815;&#xB41C;&#xB2E4;.</p>
<p>&#xC704; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xBC18;&#xD658; &#xAC12;&#xACFC; &#xC544;&#xB798; &#xC815;&#xCC45;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; Kernel&#xC740; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xD5C8;&#xC6A9;&#xD558;&#xAC70;&#xB098; &#xAC70;&#xBD80;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<ul>
<li>&#xBAA8;&#xB4E0; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD5C8;&#xC6A9;</li>
<li><code>good</code>, <code>unknown</code>, <code>bad but critical</code> &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD5C8;&#xC6A9;(&#xAE30;&#xBCF8;&#xAC12;)</li>
<li><code>good</code>, <code>unknown</code> &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD5C8;&#xC6A9;</li>
<li><code>good</code> &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD5C8;&#xC6A9;</li>
</ul>
<p>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xB2E4;&#xC74C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xC2A4;&#xCF54;&#xC5B4;&#xB97C; &#xACB0;&#xC815;&#xD55C;&#xB2E4;.</p>
<ul>
<li>&#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD30C;&#xC77C;&#xC758; &#xACBD;&#xB85C;</li>
<li>&#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4; &#xD56D;&#xBAA9;&#xC5D0; &#xB300;&#xD55C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xACBD;&#xB85C;</li>
<li>&#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xC778;&#xC99D;&#xC11C; &#xC815;&#xBCF4; (&#xAC8C;&#xC2DC;&#xC790;, &#xBC1C;&#xAE09;&#xC790;)</li>
<li>&#xC774;&#xBBF8;&#xC9C0; &#xD30C;&#xC77C; &#xD574;&#xC2DC;&#xAC12;</li>
</ul>
<p>&#xBB38;&#xC81C;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.microsoft.com/security/blog/2020/09/01/force-firmware-code-to-be-measured-and-attested-by-secure-launch-on-windows-10/">DRTM (Dynamic Root of Trust for Measurement for Measurement)</a>&#xC774; &#xC801;&#xC6A9;&#xB418;&#xBA74; &#xC774;&#xC804;&#xC5D0; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xC77D;&#xC5B4;&#xC624;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB41C; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xC5B4; &#xAD00;&#xB828; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xAE30; &#xC804;&#xC5D0;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC5D0;&#xC11C; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xC77D;&#xC744; &#xC218; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD30C;&#xC77C; &#xB0B4;&#xC6A9;&#xC774; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB178;&#xCD9C;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xAE30;&#xC874;&#xC758; &#xBA40;&#xC6E8;&#xC5B4; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB294; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xACBD;&#xB85C;, &#xD574;&#xC2DC; &#xBC0F; &#xC778;&#xC99D;&#xC11C; &#xB4F1;&#xC758; &#xC815;&#xBCF4;&#xB85C; &#xC545;&#xC131; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xCC28;&#xB2E8;&#xD558;&#xB294; &#xAC83;&#xC740; &#xD6A8;&#xACFC;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; Microsoft&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC0C8;&#xB85C;&#xC6B4; &#xADDC;&#xCE59;&#xC744; &#xC815;&#xC758;&#xD588;&#xB2E4;.</p>
<ul>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xB294; &#xB2E8;&#xC77C; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xC81C;&#xD55C;&#xB41C; &#xC2DC;&#xAC04;&#xC774; &#xC8FC;&#xC5B4;&#xC9D0;</li>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xB294; &#xBAA8;&#xB4E0; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xC81C;&#xD55C;&#xB41C; &#xC2DC;&#xAC04;&#xC774; &#xC8FC;&#xC5B4;&#xC9D0;</li>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xB294; &#xCF54;&#xB4DC; &#xBC0F; &#xAD6C;&#xC131; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD574; &#xC81C;&#xD55C;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC81C;&#xACF5;&#xB428;</li>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; ELAM &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD558;&#xC774;&#xBE0C; (<code>C:\Windows\System32\config\ELAM</code>)&#xC758; &#xD2B9;&#xC815; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4; &#xC544;&#xB798;&#xC5D0; &#xC11C;&#xBA85;&#xC744; &#xC800;&#xC7A5;&#xD574;&#xC57C; &#xD568;</li>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC11C;&#xBA85;&#xC758; &#xC720;&#xD6A8;&#xC131;&#xC744; &#xAC80;&#xC0AC;&#xD574;&#xC57C; &#xD568;.</li>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC798;&#xBABB;&#xB41C; &#xC11C;&#xBA85;&#xC744; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD568; (&#xC774; &#xACBD;&#xC6B0; &#xBAA8;&#xB4E0; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; unknown&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD568;).</li>
<li>ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC545;&#xC131; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84; (&#xB610;&#xB294; &#xB2E4;&#xB978; &#xC815;&#xCC45; &#xC704;&#xBC18;)&#xAC00; &#xC2DD;&#xBCC4;&#xB418;&#xBA74; &#xCE21;&#xC815;&#xB41C; &#xBD80;&#xD305; &#xC0C1;&#xD0DC;&#xB97C; &#xBB34;&#xD6A8;&#xD654;&#xD574;&#xC57C; &#xD568;</li>
</ul>
<p>ELAM &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xAC00; &#xCC98;&#xC74C; &#xB4F1;&#xC7A5;&#xD588;&#xC744; &#xB54C;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.welivesecurity.com/2012/12/27/win32gapz-new-bootkit-technique/">&#xD6A8;&#xC6A9;&#xC131;&#xC5D0; &#xC758;&#xBB38;&#xC774; &#xC81C;&#xAE30;&#xB418;&#xC5C8;&#xB2E4;</a>. bootkit&#xC740; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; VBR(Volume Boot Recod)&#xC5D0; &#xAE30;&#xB85D;&#xD558;&#xAC70;&#xB098; IPL(Initial Program Loader)&#xB85C; &#xB300;&#xCCB4;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xB458; &#xB2E4; Windows Kernel &#xC774;&#xC804;&#xC5D0; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; Verified/Measured &#xBD80;&#xD305;&#xC758; &#xB4F1;&#xC7A5;&#xC73C;&#xB85C; &#xC704; &#xAE30;&#xBC95;&#xC758; &#xC801;&#xC6A9;&#xC774; &#xC5B4;&#xB824;&#xC6CC;&#xC838; ELAM &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xAC00; &#xC81C; &#xAE30;&#xB2A5;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;.</p>
<h1 id="ELAM-and-Measured-Signatures"><a href="#ELAM-and-Measured-Signatures" class="headerlink" title="ELAM and Measured Signatures"></a>ELAM and Measured Signatures</h1><p>Measured &#xBD80;&#xD305; &#xC911; ELAM &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xC77D;&#xC740; &#xB2E4;&#xC74C; Windows Loader&#xC5D0;&#xC11C; &#xCE21;&#xC815;&#xD55C;&#xB2E4;(<a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows-hardware/drivers/install/elam-driver-requirements#malware-signatures">&#xCD9C;&#xCC98;</a>). &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; ELAM &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xAC00; &#xC2E0;&#xB8B0; &#xCCB4;&#xC778;&#xC5D0; &#xBC30;&#xCE58;&#xB418;&#xC5B4; &#xC99D;&#xBA85; &#xC911;&#xC5D0; &#xB204;&#xB77D; &#xD639;&#xC740; &#xB2E4;&#xC6B4;&#xADF8;&#xB808;&#xC774;&#xB4DC; &#xB41C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xAC10;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>ELAM &#xD558;&#xC774;&#xBE0C; &#xB0B4;&#xC758; &#xD2B9;&#xC815; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC704;&#xCE58;&#xB9CC; &#xCE21;&#xC815;&#xB418;&#xBA70; &#xC774; &#xAC12;&#xC744; <code>Measured</code>, <code>Policy</code> &#xBC0F; <code>Config</code>&#xB77C;&#xACE0; &#xD55C;&#xB2E4;. &#xC5EC;&#xAE30;&#xC5D0;&#xB294; &#xACF5;&#xAE09; &#xC5C5;&#xCCB4;&#xBCC4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD3EC;&#xD568;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC774;&#xB984;&#xC774; &#xB2E4;&#xB974;&#xAC70;&#xB098; &#xC720;&#xD615;&#xC774; <code>REG_BINARY</code>&#xAC00; &#xC544;&#xB2CC; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC740; &#xCE21;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%201.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%201.png"></p>
<blockquote>
<p>Table 2. Trend Micro &#xBC0F; Microsoft&#xC5D0;&#xC11C; &#xAC01;&#xAC01; &#xC800;&#xC7A5;&#xD55C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130;&#xC640; &#xCE21;&#xC815;&#xAC12;(&#xAD75;&#xAC8C; &#xD45C;&#xC2DC;&#xB428;)</p>
</blockquote>
<p>ELAM &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB294; Windows Loader&#xC5D0; &#xC758;&#xD574; &#xCE21;&#xC815;&#xB418;&#xC9C0;&#xB9CC; ELAM &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB294; Windows Kernel&#xC5D0; &#xC758;&#xD574; &#xC81C;&#xACF5;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC774; &#xC911;&#xC694;&#xD558;&#xB2E4;.</p>
<h1 id="Real-World-ELAM-Drivers"><a href="#Real-World-ELAM-Drivers" class="headerlink" title="Real-World ELAM Drivers"></a>Real-World ELAM Drivers</h1><p>2021 &#xB144; 2&#xC6D4;&#xC5D0; &#xD544;&#xC790;&#xB294; &#xC720;&#xBA85;&#xD55C; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC81C;&#xD488;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xB9AC;&#xBC84;&#xC2F1;&#xD588;&#xB2E4;. 25&#xAC1C;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC788;&#xB294; &#xCD1D; 26 &#xAC1C;&#xC758; &#xC81C;&#xD488; (2 &#xAC1C;&#xC758; &#xC81C;&#xD488;&#xC774; &#xB3D9;&#xC77C;&#xD55C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xACF5;&#xC720;)&#xC5D0;&#xC11C; 24 &#xAC1C;&#xAC00; &#xAE30;&#xBCF8; &#xAD6C;&#xC131;&#xC73C;&#xB85C; &#xC124;&#xCE58;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xB2E4;. </p>
<p>&#xD765;&#xBBF8;&#xB86D;&#xAC8C;&#xB3C4; &#xBAA8;&#xB4E0; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xB294; &#xBCF4;&#xD638;&#xB41C; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xB370; &#xD544;&#xC694;&#xD55C; &#xC778;&#xC99D;&#xC11C; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC9C0;&#xB9CC; 26&#xAC1C; &#xC911; 15&#xAC1C; &#xC81C;&#xD488;&#xC5D0;&#xC11C; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB300;&#xD574; &#xAC80;&#xC0AC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xD558;&#xB4DC;&#xCF54;&#xB529;&#xB41C; &#xACB0;&#xACFC;&#xAC12;&#xC744; &#xBC18;&#xD658;&#xD558;&#xAC70;&#xB098; &#xACB0;&#xACFC;&#xAC12;&#xC744; &#xC804;&#xD600; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. </p>
<blockquote>
<p>&#xC774;&#xB7EC;&#xD55C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; placeholder driver&#xB77C;&#xACE0; &#xD55C;&#xB2E4;.</p>
</blockquote>
<p>&#xB450; &#xAC1C;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xB7F0;&#xD0C0;&#xC784; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC5D0; &#xB300;&#xD55C; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC815;&#xBCF4;&#xB97C; &#xAE30;&#xB85D;&#xD588;&#xC9C0;&#xB9CC; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xC81C; &#xAC80;&#xC0AC;&#xAC00; &#xC218;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xBA70; &#xACB0;&#xACFC;&#xAC12;&#xC740; &#xD56D;&#xC0C1; <code>unknown</code>&#xC774;&#xC5C8;&#xACE0;, &#xD55C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xAC80;&#xC0AC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xBAA8;&#xB4E0; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xACB0;&#xACFC;&#xAC12;&#xC744; <code>good</code>&#xC73C;&#xB85C; &#xBCF4;&#xACE0;&#xD588;&#xB2E4;.</p>
<p>11&#xAC1C;&#xC758; &#xC81C;&#xD488;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xB300;&#xD574; &#xBA87; &#xAC00;&#xC9C0; &#xAC80;&#xC0AC;&#xB97C; &#xC218;&#xD589;&#xD588;&#xB2E4;. &#xADF8;&#xC911; &#xD558;&#xB098;&#xB294; &#xC54C;&#xB824;&#xC9C4; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xC778;&#xC99D;&#xC11C;&#xC758; &#xD558;&#xB4DC;&#xCF54;&#xB529;&#xB41C; &#xBAA9;&#xB85D;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xACE0; ELAM &#xD558;&#xC774;&#xBE0C;&#xB294; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xBA70; 2&#xAC1C;&#xB294; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130;&#xC5D0; ELAM &#xD558;&#xC774;&#xBE0C;&#xC640; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xBAA8;&#xB450; &#xC0AC;&#xC6A9;&#xD588;&#xB2E4;. &#xD558;&#xB098;&#xB294; ELAM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xB4A4; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130; &#xB300;&#xCCB4;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; 7&#xAC1C;&#xC758; &#xC81C;&#xD488;&#xC740; ELAM &#xD558;&#xC774;&#xBE0C;&#xC5D0;&#xC11C;&#xB9CC; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC5C8;&#xB2E4;.</p>
<p>11 &#xAC1C;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC911; &#xB2E8; 2&#xAC1C;&#xB9CC; &#xACB0;&#xACFC;&#xAC12;&#xC5D0; &#xB530;&#xB77C; &#xC99D;&#xBA85;&#xC744; &#xCDE8;&#xC18C;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC73C;&#xBA70; &#xB2E4;&#xB978; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xD574;&#xB2F9; &#xB8E8;&#xD2F4;&#xC744; &#xD638;&#xCD9C;&#xC870;&#xCC28; &#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; &#xC81C;&#xD488;&#xC758; &#xC774;&#xB984;&#xC744; &#xC5B8;&#xAE09;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xB2E4;.</p>
<p>&#xB180;&#xB78D;&#xAC8C;&#xB3C4; Windows Defender&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xB294; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC5B8;&#xAE09;&#xB41C; &#xBAA8;&#xB4E0; &#xADDC;&#xCE59;&#xC744; &#xB530;&#xB974;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xBA70; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130;&#xC758; &#xC800;&#xC7A5; &#xC704;&#xCE58;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; (&#xAE30;&#xBCF8; &#xC704;&#xCE58; &#xC778; ELAM &#xD558;&#xC774;&#xBE0C; &#xC81C;&#xC678;) &#xC545;&#xC131; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xAC10;&#xC9C0;&#xB418;&#xC5C8;&#xC744; &#xB54C; &#xC99D;&#xBA85;&#xC744; &#xCDE8;&#xC18C;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;.</p>
<p>Kaspersky &#xBC0F; ZoneAlarm &#xC81C;&#xD488;&#xC758; &#xB3D9;&#xC77C;&#xD55C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; ELAM &#xD558;&#xC774;&#xBE0C;&#xC640; SYSTEM &#xD558;&#xC774;&#xBE0C; &#xB450; &#xC704;&#xCE58;&#xC5D0;&#xC11C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC5C8;&#xC73C;&#xBA70; &#xC99D;&#xBA85; &#xB610;&#xD55C; &#xCDE8;&#xC18C;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;.</p>
<p>Sophos &#xC81C;&#xD488;&#xC758; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xBAA8;&#xB4E0; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; <code>good</code>&#xC73C;&#xB85C; &#xD45C;&#xC2DC;&#xD55C;&#xB2E4;. &#xC774;&#xB294; Sophos&#xC5D0; &#xBCF4;&#xC548; &#xC774;&#xC288;&#xB85C; &#xBCF4;&#xACE0;&#xB418;&#xC5C8;&#xC9C0;&#xB9CC; &#xBCF4;&#xC548; &#xC0C1;&#xC758; &#xACB0;&#xD568;&#xC774; &#xC5C6;&#xB294; &#xC758;&#xB3C4;&#xB41C; &#xAE30;&#xB2A5;&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xB418;&#xC5C8;&#xB2E4;.</p>
<p>&#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74;, &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC81C;&#xD488;&#xC740; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC545;&#xC131; boot-start &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xAC80;&#xC0C9;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xB300;&#xC2E0; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC790;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xBCF4;&#xD638;&#xB41C; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xACE0; &#xD575;&#xC2EC; ELAM &#xAE30;&#xB2A5;&#xC740; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xB41C; &#xB2E8;&#xC77C; &#xACB0;&#xACFC;&#xAC12;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xAC70;&#xB098; &#xACB0;&#xACFC;&#xAC12;&#xC744; &#xC804;&#xD600; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xB2E4;.</p>
<h1 id="ELAM-Hive"><a href="#ELAM-Hive" class="headerlink" title="ELAM Hive"></a>ELAM Hive</h1><p>ELAM &#xD558;&#xC774;&#xBE0C;&#xB294; <code>C:\Windows\System32\config\ELAM</code> &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/msuhanov/regf/blob/master/Windows%20registry%20file%20format%20specification.md">&#xC774;&#xC804; &#xAE00;&#xC5D0;</a> &#xD574;&#xB2F9; &#xD3EC;&#xB9F7;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC774; &#xC788;&#xC73C;&#xBA70; &#xCDE8;&#xC57D;&#xC131;&#xC744; &#xC774;&#xD574;&#xD558;&#xB294; &#xB370; &#xD544;&#xC694;&#xD55C; &#xBA87; &#xAC00;&#xC9C0; &#xD575;&#xC2EC; &#xC0AC;&#xD56D;&#xC774; &#xC788;&#xB2E4;.</p>
<ul>
<li>&#xD0A4; &#xB178;&#xB4DC;&#xB294; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC744; &#xAC00;&#xB9AC;&#xD0AC; &#xC218; &#xC788;&#xB2E4;.<ul>
<li>&#xD0A4; &#xB178;&#xB4DC; : &#xB2E8;&#xC77C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xAD6C;&#xC870;</li>
<li>&#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D; : &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xC758; &#xD558;&#xC704; &#xD0A4;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; &#xD0A4; &#xB178;&#xB4DC;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B; &#xBAA9;&#xB85D;</li>
</ul>
</li>
<li>&#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xD0A4; &#xB178;&#xB4DC;&#xB294; &#xAC12; &#xBAA9;&#xB85D;&#xC744; &#xAC00;&#xB9AC;&#xD0AC; &#xC218; &#xC788;&#xB2E4;.<ul>
<li>&#xAC12; &#xBAA9;&#xB85D;: &#xD0A4; &#xAC12;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B; &#xBAA9;&#xB85D;, &#xAC01; &#xD0A4; &#xAC12;&#xC740; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xB2E8;&#xC77C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC744; &#xC124;&#xBA85;&#xD568;</li>
</ul>
</li>
<li><code>0xFFFFFFFF</code>&#xC640; &#xAC19;&#xC740; &#xC624;&#xD504;&#xC14B;&#xC740; &#x201C;nil&#x201D;&#xC744; &#xD45C;&#xD604;&#xD55C;&#xB2E4;.</li>
<li>&#xC774;&#xB7EC;&#xD55C; &#xC624;&#xD504;&#xC14B;&#xC740; &#xC808;&#xB313;&#xAC12;&#xC774; &#xC544;&#xB2C8;&#xBA70; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC77C;&#xC758; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xC624;&#xD504;&#xC14B;&#xC744; &#xC5BB;&#xC73C;&#xB824;&#xBA74; 4096 bytes&#xB97C; &#xCD94;&#xAC00;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.</li>
<li>&#xD0A4; &#xB178;&#xB4DC;&#xC640; &#xD0A4; &#xAC12;&#xC740; &#xAC01;&#xAC01; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xC758; &#xC774;&#xB984;&#xACFC; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC758; &#xC774;&#xB984;&#xC744; &#xC800;&#xC7A5;&#xD55C;&#xB2E4;. &#xC774;&#xB294; &#xD655;&#xC7A5; ASCII (Latin-1) &#xBB38;&#xC790;&#xC5F4; &#xD639;&#xC740; UTF-16LE &#xBB38;&#xC790;&#xC5F4;&#xC774;&#xB2E4;. (&#xD655;&#xC7A5; ASCII &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA74; &#xD574;&#xB2F9; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC555;&#xCD95;&#xB428;.)</li>
<li>&#xD558;&#xC704; &#xD0A4;&#xC5D0;&#xC11C; &#xB300;&#xC18C;&#xBB38;&#xC790;&#xB97C; &#xAD6C;&#xBD84;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xAC80;&#xC0C9;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC744; &#xB300;&#xBB38;&#xC790; &#xC774;&#xB984;(&#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;)&#xC73C;&#xB85C; &#xC815;&#xB82C;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.<ul>
<li>&#xAC12; &#xBAA9;&#xB85D;&#xC740; &#xC815;&#xB82C;&#xD560; &#xD544;&#xC694; &#xC5C6;&#xC74C;</li>
</ul>
</li>
<li>&#xD0A4; &#xAC12;&#xC740; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC758; &#xB370;&#xC774;&#xD130; &#xC720;&#xD615;(&#xC608; : REG_BINARY)&#xC744; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xB9AC;&#xD0A8;&#xB2E4;.</li>
<li>4 bytes &#xC774;&#xD558;&#xC758; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB294; &#xD0A4; &#xAC12;&#xC5D0; &#xC9C1;&#xC811; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;.</li>
<li>4 bytes &#xBCF4;&#xB2E4; &#xD070; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB294; &#xB2E4;&#xB978; &#xC624;&#xD504;&#xC14B;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA70; &#xC774; &#xC624;&#xD504;&#xC14B;&#xC740; &#xD0A4; &#xAC12;&#xC5D0; &#xAE30;&#xB85D;&#xB41C;&#xB2E4;.</li>
<li>16344 bytes&#xBCF4;&#xB2E4; &#xD070; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB294; 16344 btyes &#xC774;&#xD558;&#xC758; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xACE0; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B;&#xC740; &#xBAA9;&#xB85D;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xB41C;&#xB2E4;. &#xD0A4; &#xAC12;&#xC5D0;&#xB294; &#xB370;&#xC774;&#xD130; &#xB300;&#xC2E0; &#xBAA9;&#xB85D;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B;&#xC774; &#xC800;&#xC7A5;&#xB41C; Big Data Record&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;.</li>
</ul>
<p>&#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC77C;&#xC758; &#xC608;&#xC81C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%202.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%202.png"></p>
<blockquote>
<p>Figure 1<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - ELAM &#xD558;&#xC774;&#xBE0C;&#xC758; root key &#xB178;&#xB4DC;<br>&#xB179;&#xC0C9; - &#xD558;&#xC704; &#xD0A4;&#xC758; &#xAC1C;&#xC218;(2&#xAC1C;)<br>&#xBE68;&#xAC04;&#xC0C9; - &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B; (0x3328, &#xC808;&#xB300; &#xC624;&#xD504;&#xC14B;: 0x3328+4096=0x4328)<br>&#xB178;&#xB780;&#xC0C9; - &#xD0A4; &#xC774;&#xB984; (&#x201C;ROOT&#x201D;, ASCII &#xBB38;&#xC790;&#xC5F4;)</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%203.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%203.png"></p>
<blockquote>
<p>Figure 2<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#xB8E8;&#xD2B8; &#xD0A4;&#xC5D0; &#xB300;&#xD55C; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;<br>&#xB178;&#xB780;&#xC0C9; - &#xBAA9;&#xB85D;&#xC758; &#xC694;&#xC18C; &#xC218; (2&#xAC1C;)<br>&#xBE68;&#xAC04;&#xC0C9; - &#xB450; &#xAC1C;&#xC758; &#xD558;&#xC704; &#xD0A4;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B; (0x3188 &#xBC0F; 0x0120, &#xC774; &#xC720;&#xD615;&#xC758; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0;&#xC11C;&#xB294; 4 &#xAC1C;)</p>
</blockquote>
<p>&#xAC01; &#xC624;&#xD504;&#xC14B; &#xB4A4;&#xC5D0;&#xB294; &#xC774;&#xB984; &#xD574;&#xC2DC;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xB85C; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;. (<code>0x3188</code>&#xC740; &#x201C;Trend Micro&#x201D; &#xD0A4; &#xB178;&#xB4DC;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xACE0; <code>0x0120</code>&#xC740; &#x201C;Windows Defender&#x201D; &#xD0A4; &#xB178;&#xB4DC;&#xC5D0; &#xD574;&#xB2F9;&#xB428;)</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%204.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%204.png"></p>
<blockquote>
<p>Figure 3<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#x201C;Windows Defender&#x201D; &#xD0A4; &#xB178;&#xB4DC;<br>&#xBE68;&#xAC04;&#xC0C9; - &#xAC12; &#xB370;&#xC774;&#xD130;(1)<br>&#xB178;&#xB780;&#xC0C9; - &#xBAA9;&#xB85D;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B; (0x3180)</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%205.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%205.png"></p>
<blockquote>
<p>Figure 4<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#xAC12; &#xBAA9;&#xB85D;(&#xC720;&#xD6A8;&#xD55C; &#xD56D;&#xBAA9;&#xC740; 0x0230)</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%206.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%206.png"></p>
<blockquote>
<p>Figure 5<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#xD0A4; &#xAC12;<br>&#xB178;&#xB780;&#xC0C9; - &#xB370;&#xC774;&#xD130; &#xD06C;&#xAE30; (0x215C &#xB610;&#xB294; 8540 bytes)<br>&#xBE68;&#xAC04;&#xC0C9; - &#xB370;&#xC774;&#xD130; &#xC624;&#xD504;&#xC14B; (0x1020, &#xB370;&#xC774;&#xD130;&#xAC00; 4 bytes &#xC774;&#xD558;&#xC778; &#xACBD;&#xC6B0; &#xC9C1;&#xC811; &#xC800;&#xC7A5;)<br>&#xD30C;&#xB780;&#xC0C9; - &#xAC12; &#xC720;&#xD615; (3 &#xB610;&#xB294; REG_BINARY)<br>&#xB179;&#xC0C9; - &#xAC12; &#xC774;&#xB984; ( &#x201C;Measured&#x201D;, ASCII &#xBB38;&#xC790;&#xC5F4;)</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%207.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%207.png"></p>
<blockquote>
<p>Figure 6<br>&#xAC12; &#xB370;&#xC774;&#xD130;</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%208.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%208.png"></p>
<blockquote>
<p>Figure 7<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#xB370;&#xC774;&#xD130;&#xAC00; 16344 bytes&#xBCF4;&#xB2E4; &#xD06C;&#xACE0; &#xD558;&#xC774;&#xBE0C; &#xD615;&#xC2DD; &#xBC84;&#xC804;&#xC774; 1.4 &#xC774;&#xC0C1;&#xC778; &#xACBD;&#xC6B0;&#xC758; Big Data Record Structure<br>&#xBE68;&#xAC04;&#xC0C9; - &#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xC218; (2),<br>&#xB178;&#xB780;&#xC0C9; - &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xBAA9;&#xB85D;&#xC5D0; &#xB300;&#xD55C; &#xC624;&#xD504;&#xC14B; (0x3188)</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%209.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%209.png"></p>
<blockquote>
<p>Figure 8<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#xAC12; &#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xBAA9;&#xB85D;<br>&#xBE68;&#xAC04;&#xC0C9; - &#xB450; &#xAC1C;&#xC758; &#xC624;&#xD504;&#xC14B; (0x4020 &#xBC0F; 0x 8020)</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2010.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2010.png"></p>
<blockquote>
<p>Figure 9<br>&#xC120;&#xD0DD;&#xB41C; &#xC601;&#xC5ED; - &#xC138;&#xADF8;&#xBA3C;&#xD2B8;, &#xCCAB; &#xBC88;&#xC9F8; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0;&#xB294; 16344 bytes&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0;&#xB294; &#xB098;&#xBA38;&#xC9C0; &#xB370;&#xC774;&#xD130;&#xAC00; &#xD3EC;&#xD568;&#xB428;</p>
</blockquote>
<p>&#xC720;&#xC2EC;&#xD788; &#xBD10;&#xC57C; &#xD560; &#xBA87; &#xAC00;&#xC9C0; &#xC138;&#xBD80; &#xC0AC;&#xD56D;</p>
<ol>
<li>&#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD558;&#xC774;&#xBE0C;&#xAC00; &#xB85C;&#xB4DC;&#xB418;&#xBA74; &#xD615;&#xC2DD; &#xC704;&#xBC18;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C;&#xB2E4;. &#xC704;&#xBC18;&#xC774; &#xAC10;&#xC9C0;&#xB418;&#xBA74; &#xCC38;&#xC870;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xC5EC; &#xC774;&#xB97C; &#xC218;&#xC815;&#xD558;&#xAC70;&#xB098; &#xAD00;&#xB828; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;&#xB97C; &#xC0AD;&#xC81C;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD55C;&#xB2E4;.</li>
<li>&#xBAA8;&#xB4E0; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0; &#xC788;&#xB294; &#xC694;&#xC18C;&#xC758; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC774; &#xD655;&#xC778;&#xB41C;&#xB2E4;. &#xB450; &#xAC1C;&#xC758; &#xD558;&#xC704; &#xD0A4; (&#xC8FC;&#xC5B4;&#xC9C4; &#xBAA9;&#xB85D;&#xC5D0; &#xC788;&#xB294; &#xD604;&#xC7AC; &#xD0A4;&#xC640; &#xC774;&#xC804; &#xD0A4;)&#xB97C; &#xBE44;&#xAD50;&#xD55C; &#xACB0;&#xACFC; &#xC798;&#xBABB;&#xB41C; &#xC21C;&#xC11C;&#xB85C; &#xD45C;&#xC2DC;&#xB418;&#xBA74; &#xD604;&#xC7AC; &#xD0A4;&#xAC00; &#xC0AD;&#xC81C;&#xB41C;&#xB2E4;.</li>
<li>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xD558;&#xC774;&#xBE0C;&#xAC00; &#xB9C8;&#xC6B4;&#xD2B8; &#xB418;&#xBA74; &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC7A0;&#xAE30;&#xAC8C; &#xB41C;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xAC00; &#xBD80;&#xD305;&#xC744; &#xC644;&#xB8CC;&#xD558;&#xBA74; ELAM &#xD558;&#xC774;&#xBE0C;&#xB294; &#xB9C8;&#xC6B4;&#xD2B8; &#xD574;&#xC81C;&#xB41C; &#xC0C1;&#xD0DC;&#xB85C; &#xC720;&#xC9C0;&#xB41C;&#xB2E4;.</li>
<li>ELAM &#xD558;&#xC774;&#xBE0C;&#xB294; &#xD615;&#xC2DD; &#xBC84;&#xC804; 1.5&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; Big Data Record&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB41C;&#xB2E4;.</li>
<li>&#xBD80;&#xD305; &#xC911;&#xC5D0; Windows Loader&#xB294; ELAM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xB2E8;&#xC77C; &#xBA54;&#xBAA8;&#xB9AC; &#xCCAD;&#xD06C;&#xB85C; &#xC77D;&#xB294;&#xB2E4;.</li>
</ol>
<h1 id="Measured-Boot-Vulnerabilities"><a href="#Measured-Boot-Vulnerabilities" class="headerlink" title="Measured Boot Vulnerabilities"></a>Measured Boot Vulnerabilities</h1><p>2020&#xB144; &#xB9D0;, 2021&#xB144; &#xCD08; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; Measured Booting &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xACE0; ELAM &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xC190;&#xC0C1; &#xBC0F; &#xC0AD;&#xC81C;&#xD560; &#xC218; &#xC788;&#xB294; &#xB450; &#xAC00;&#xC9C0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xACE0; &#xBCF4;&#xACE0;&#xD588;&#xB2E4;.</p>
<p>&#xD2B9;&#xD788;, Windows Loader&#xB294; ELAM &#xD558;&#xC774;&#xBE0C;&#xC5D0;&#xC11C; &#xC608;&#xC0C1;&#xB418;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC744; &#xCE21;&#xC815;&#xD558;&#xB294; &#xBC18;&#xBA74; Windows Kernel&#xC740; &#xC190;&#xC0C1;&#xB41C; ELAM &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xAC70;&#xB098; &#xD574;&#xB2F9; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC774; &#xC5C6;&#xB294; &#xD558;&#xC774;&#xBE0C;&#xC5D0;&#xC11C; &#xB2E4;&#xB978; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD655;&#xC778;&#xD574; &#xC774;&#xB7EC;&#xD55C; Loader&#xC640; Kernel&#xC758; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC2F1; &#xCF54;&#xB4DC;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD55C;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2011.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2011.png"></p>
<blockquote>
<p>&#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC758; CVE ID</p>
</blockquote>
<p>&#xB450; &#xCDE8;&#xC57D;&#xC810; &#xBAA8;&#xB450; &#xBCF4;&#xC0C1;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xC73C;&#xBA70; CVE-2021&#x2013;27094&#xC758; &#xACBD;&#xC6B0; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xBC30;&#xD3EC;&#xD558;&#xB294; &#xB370; 90&#xC77C; &#xC774;&#xC0C1;&#xC774; &#xAC78;&#xB838;&#xACE0; &#xD574;&#xB2F9; &#xD328;&#xCE58;&#xB85C; &#xC778;&#xD574; &#xB370;&#xC774;&#xD130; &#xC190;&#xC0C1; &#xC774;&#xC288;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;.</p>
<h2 id="CVE-2021&#x2013;28447"><a href="#CVE-2021&#x2013;28447" class="headerlink" title="CVE-2021&#x2013;28447"></a>CVE-2021&#x2013;28447</h2><p>16344 bytes&#xBCF4;&#xB2E4; &#xD070; &#xB370;&#xC774;&#xD130;&#xB85C; ELAM &#xAC12;&#xC744; &#xCE21;&#xC815;&#xD560; &#xB54C; Windows Loader&#xB294; Big Data Record&#xB97C; &#xD30C;&#xC2F1;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xCE21;&#xC815; &#xC911;&#xC778; ELAM blob&#xC774; 16344 bytes&#xBCF4;&#xB2E4; &#xD06C;&#xBA74; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC544;&#xB798;&#xB294; &#xCE21;&#xC815;&#xB41C; ELAM &#xAC12;&#xC5D0; &#xB300;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB514; &#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xD568;&#xC218;&#xC774;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2012.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2012.png"></p>
<blockquote>
<p>&#xCE21;&#xC815; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838; &#xC624;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD568;&#xC218;</p>
</blockquote>
<p>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xACBD;&#xC6B0; &#xAC12; &#xB370;&#xC774;&#xD130;&#xAC00; 16344 bytes &#xBCF4;&#xB2E4; &#xD06C;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; <code>KeyValue-&gt;Data</code> &#xD544;&#xB4DC;&#xC5D0;&#xB294; &#xC804;&#xCCB4; &#xAC12; &#xB370;&#xC774;&#xD130;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xACE0; <code>memmove()</code> &#xD568;&#xC218;&#xB85C; &#xD574;&#xB2F9; &#xD544;&#xB4DC;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCC0;&#xC218; <code>Heap</code>&#xC5D0; &#xBCF5;&#xC0AC;&#xD55C;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xC5D0;&#xB294; &#xD558;&#xC774;&#xBE0C; &#xD615;&#xC2DD; &#xBC84;&#xC804;, &#xAC12; &#xB370;&#xC774;&#xD130; &#xD06C;&#xAE30;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC0AC; &#xB4F1; Big Data Record&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xCF54;&#xB4DC;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xB370;&#xC774;&#xD130;&#xAC00; 16344 bytes&#xBCF4;&#xB2E4; &#xD06C;&#xBA74; <code>KeyValue-&gt;Data</code>&#xC5D0;&#xB294; &#xAC12; &#xB370;&#xC774;&#xD130; &#xB300;&#xC2E0; Big Data Record&#xB85C; &#xCC44;&#xC6CC;&#xC9C0;&#xC9C0;&#xB9CC; <code>memmove()</code> &#xD638;&#xCD9C;&#xC740; &#xC774;&#xB97C; &#xB370;&#xC774;&#xD130;&#xB85C; &#xC0DD;&#xAC01;&#xD574; Big Data Record&#xC640; &#xC774;&#xD6C4; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB85C;&#xB4DC;&#xB41C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC77C;&#xC5D0;&#xC11C; <code>Heap</code>&#xC73C;&#xB85C; &#xBCF5;&#xC0AC;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;. </p>
<p>&#xC774;&#xB97C; &#xC545;&#xC6A9;&#xD558;&#xBA74; &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC5D0;&#xC11C; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xCE21;&#xC815;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xACE0; ELAM Blob&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xAC12; &#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xAC00; Big Data Record &#xC774;&#xC804;&#xC5D0;, &#xC989; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC77C;&#xC758; &#xB354; &#xB0AE;&#xC740; &#xC624;&#xD504;&#xC14B;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA74; &#xD799; &#xBCC0;&#xC218;&#xC5D0; &#xD3EC;&#xD568;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xCE21;&#xC815;&#xB418;&#xC5B4; &#xC2E4;&#xC81C; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB294; &#xCE21;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB610;&#xB294; &#xAC12; &#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xAC00; Big Data Record &#xC774;&#xD6C4;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA74; &#xCE21;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC544; &#xCE21;&#xC815; &#xC911; &#xACC4;&#xC0B0;&#xB41C; &#xD574;&#xC2DC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC774;&#xD6C4;&#xC758; &#xAC12; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>ELAM &#xD558;&#xC774;&#xBE0C;&#xB294; &#xBD80;&#xD305; &#xC644;&#xB8CC; &#xC774;&#xD6C4;&#xC5D0;&#xB294; &#xB85C;&#xB4DC;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C; &#xC5B4;&#xB5A4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C;&#xB4E0; (&#xC608; : HEX &#xD3B8;&#xC9D1;&#xAE30; &#xB4F1;) &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD30C;&#xC77C;&#xC744; &#xC81C;&#xD55C; &#xC5C6;&#xC774; &#xC784;&#xC758;&#xB85C; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;. </p>
<h3 id="Root-Cause"><a href="#Root-Cause" class="headerlink" title="Root Cause"></a>Root Cause</h3><p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC774;&#xC804;&#xC5D0;&#xB294; Windows Loader&#xC5D0;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAC12;&#xC744; &#xC77D;&#xC744; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC5C8;&#xC73C;&#xBBC0;&#xB85C; Big Data Record &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xB808;&#xAC70;&#xC2DC; &#xCF54;&#xB4DC;&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;.</p>
<h3 id="Fix"><a href="#Fix" class="headerlink" title="Fix"></a>Fix</h3><p>Microsoft&#xB294; Windows Loader&#xC5D0;&#xC11C; Big Data Record &#xCF00;&#xC774;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC6D0;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xC5EC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC218;&#xC815;&#xD588;&#xB2E4;. &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC740; ELAM blob&#xC758; &#xC784;&#xACC4;&#xAC12;&#xC778; 16344 bytes&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xC9C0; &#xC54A;&#xB294; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xB294; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. </p>
<h3 id="Original-vulnerability-report"><a href="#Original-vulnerability-report" class="headerlink" title="Original vulnerability report"></a>Original vulnerability report</h3><pre><code class="hljs c"># Summary

When an ELAM driver stores a binary larger than 16344 bytes in one of three measured values (called &quot;Measured&quot;, &quot;Policy&quot;, or &quot;Config&quot;) within the ELAM hive (&quot;C:\Windows\System32\config\ELAM&quot;), this binary isn&apos;t measured correctly by the Windows loader (winload.exe or winload.efi).
Under specific conditions, a modification made to an ELAM blob won&apos;t result in different PCR values, thus not affecting the measured boot (since PCR values are equal to the expected ones).

# Description

## Steps to reproduce

(Screenshots attached.)
<span class="hljs-number">1.</span> Mount the ELAM hive <span class="hljs-keyword">using</span> a registry editor.

<span class="hljs-number">2.</span> Add a <span class="hljs-keyword">new</span> key under the root of the ELAM hive. Assign a <span class="hljs-keyword">new</span> value to <span class="hljs-keyword">this</span> key (in <span class="hljs-keyword">this</span> report, the value will be called <span class="hljs-string">&quot;Measured&quot;</span>).

<span class="hljs-number">3.</span> Write more than <span class="hljs-number">16344</span> bytes of data to that value (see: <span class="hljs-string">&quot;01-elam-blob.png&quot;</span>).

<span class="hljs-number">4.</span> Unmount the ELAM hive.

<span class="hljs-number">5.</span> Reboot the system.

<span class="hljs-number">6.</span> During the boot, the Windows loader measures data starting from the beginning of the CM_BIG_DATA structure as pointed by the CM_KEY_VALUE structure describing the <span class="hljs-string">&quot;Measured&quot;</span> value (see: <span class="hljs-string">&quot;02-elam-blob-measured.png&quot;</span>). 
   Since the expected data length is larger than the CM_BIG_DATA structure, subsequent bytes of the hive file (actually, from the memory region used to store the hive file loaded) are included into the measurement (instead of actual value data).

<span class="hljs-number">7.</span> After the boot, change (<span class="hljs-keyword">using</span> a registry editor) several bytes within the value data, without altering the data size (see: <span class="hljs-string">&quot;03-elam-blob-altered.png&quot;</span>).

<span class="hljs-number">8.</span> Reboot the system.

<span class="hljs-number">9.</span> During the boot, the Windows loader will see the same CM_BIG_DATA structure <span class="hljs-keyword">and</span> subsequent bytes as value data (see: <span class="hljs-string">&quot;04-elam-blob-altered-measured.png&quot;</span>).

## Root cause

The Windows loader doesn<span class="hljs-number">&apos;</span>t support parsing value data stored <span class="hljs-keyword">using</span> the CM_BIG_DATA structure. This structure is used when the hive format version is <span class="hljs-number">1.4</span> <span class="hljs-keyword">or</span> newer <span class="hljs-keyword">and</span> value data to be stored is larger than <span class="hljs-number">16344</span> bytes.
The ELAM hive uses the format version <span class="hljs-number">1.5</span>. Thus, the CM_BIG_DATA structure is supported in the NT kernel, but <span class="hljs-keyword">not</span> in the Windows loader.
The OslGetBinaryValue routine (in the Windows loader) provides back a pointer to cell data containing the CM_BIG_DATA structure instead of parsing <span class="hljs-keyword">this</span> <span class="hljs-keyword">and</span> related structures <span class="hljs-keyword">and</span> then providing a pointer to consolidated data segments.

## Attack scenarios

First, ELAM blobs larger than <span class="hljs-number">16344</span> bytes aren<span class="hljs-number">&apos;</span>t measured correctly. This is a serious security issue by itself.
Finally, <span class="hljs-keyword">if</span> an ELAM driver uses existing measured ELAM blobs larger than <span class="hljs-number">16344</span> bytes, a malicious usermode program could alter (corrupt <span class="hljs-keyword">or</span> downgrade) these blobs without affecting the measured boot.

Such an attack is possible when:
* a <span class="hljs-built_in">list</span> of cells containing value data segments is stored before the CM_BIG_DATA structure, <span class="hljs-keyword">or</span>
* such value data segments are stored before the CM_BIG_DATA structure, <span class="hljs-keyword">or</span>
* a <span class="hljs-built_in">list</span> of cells containing value data segments <span class="hljs-keyword">and</span> such value data segments are all stored after the CM_BIG_DATA structure, but there is a large gap after the CM_BIG_DATA structure 
  (which isn<span class="hljs-number">&apos;</span>t smaller than the defined value data size, so the hash calculation won<span class="hljs-number">&apos;</span>t reach the actual value data, <span class="hljs-keyword">or</span> it<span class="hljs-number">&apos;</span>s smaller than that, but the hash calculation doesn<span class="hljs-number">&apos;</span>t reach the modified bytes of actual value data).

Under any specific condition defined above, changing offsets to value data segments <span class="hljs-keyword">or</span> changing value data segments respectively won<span class="hljs-number">&apos;</span>t be noticed during the measurement. 
(Since the hash is calculated over the internals of the hive file, but <span class="hljs-keyword">not</span> over the actual value data.)
Since the ELAM hive isn<span class="hljs-number">&apos;</span>t loaded after the boot, a malicious usermode program can open it <span class="hljs-keyword">and</span> alter its data in any way possible 
(<span class="hljs-keyword">this</span> is <span class="hljs-keyword">not</span> limited to registry functions exposed by the Advapi32 library, the hive file can be opened <span class="hljs-keyword">and</span> edited in a HEX editor), thus exploiting any pre-existing condition defined above.

## Possible solution

Handle the CM_BIG_DATA structure when parsing a registry value <span class="hljs-keyword">using</span> the Windows loader.</code></pre>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC758; &#xAD00;&#xB828; &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7;&#xC740; &#xC544;&#xB798;&#xC5D0; &#xCCA8;&#xBD80;&#xB418;&#xC5B4; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2013.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2013.png"></p>
<blockquote>
<p>01-elam-blob.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2014.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2014.png"></p>
<blockquote>
<p>02-elam-blob-measured.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2015.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2015.png"></p>
<blockquote>
<p>03-elam-blob-altered.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2016.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2016.png"></p>
<blockquote>
<p>04-elam-blob-altered-measured.png</p>
</blockquote>
<h2 id="CVE-2021&#x2013;27094"><a href="#CVE-2021&#x2013;27094" class="headerlink" title="CVE-2021&#x2013;27094"></a>CVE-2021&#x2013;27094</h2><p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC55E;&#xC11C; &#xC18C;&#xAC1C;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xBCF4;&#xB2E4; &#xC870;&#xAE08; &#xBCF5;&#xC7A1;&#xD558;&#xB2E4;.<br>Windows Loader &#xB610;&#xB294; Windows Kernel&#xC5D0;&#xC11C;&#xB294; &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xB85C;&#xB4DC;&#xD560; &#xB54C; &#xD615;&#xC2DD; &#xC704;&#xBC18;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C;&#xB2E4;. &#xC774; &#xAC80;&#xC0AC;&#xB294; Windows Loader&#xC5D0; &#xC758;&#xD574; &#xB85C;&#xB4DC;&#xB41C; &#xD558;&#xC774;&#xBE0C;&#xC5D0; &#xB300;&#xD574; &#xB450; &#xBC88; &#xC218;&#xD589;&#xD55C; &#xB4A4; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; Windows Kernel&#xB85C; &#xC804;&#xB2EC;&#xB41C;&#xB2E4; (ELAM &#xD558;&#xC774;&#xBE0C; &#xD3EC;&#xD568;).</p>
<p>&#xC774; &#xAC80;&#xC0AC; &#xB85C;&#xC9C1;&#xC740; Windwos Loader&#xC640; Kernel&#xC774; &#xC720;&#xC0AC;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xC9C0;&#xB9CC; &#xCC28;&#xC774;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;. &#xADF8;&#xC911; &#xD558;&#xB098;&#xAC00; Windows Loader&#xB294; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0; &#xC788;&#xB294; &#xC694;&#xC18C;&#xC758; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC744; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>ELAM &#xD558;&#xC774;&#xBE0C;&#xB294; Windows Kernel&#xC5D0; &#xC758;&#xD574; &#xC2DC;&#xC791;&#xB41C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xBBC0;&#xB85C; Windows Loader&#xC758; ELAM blob &#xCE21;&#xC815;&#xACFC; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC0AC;&#xC6A9; &#xC0AC;&#xC774;&#xC758; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C; &#xAC80;&#xC0AC;&#xAC00; &#xC0BD;&#xC785;&#xB41C;&#xB2E4;. Windows Loader&#xC5D0;&#xC11C; &#xCE21;&#xC815;&#xD55C; &#xD6C4; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804; ELAM blob&#xC744; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xC784;&#xC758; &#xC0AD;&#xC81C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774; &#xAC80;&#xC0AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xACF5;&#xACA9;&#xC790;&#xB294; &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xB9C8;&#xC6B4;&#xD2B8; &#xD55C; &#xB2E4;&#xC74C; &#xD45C;&#xC900; API&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xB8E8;&#xD2B8; &#xD0A4; &#xC544;&#xB798;&#xC5D0; &#xC788;&#xB294; ELAM &#xD558;&#xC774;&#xBE0C;&#xC5D0; &#xBE48;(&#xAC12;&#xC774; &#xC5C6;&#xB294;) &#xD0A4;&#xB97C; &#xC0BD;&#xC785;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; Windows Kernel&#xC774; &#xCE21;&#xC815;&#xB41C; ELAM blob&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xD0A4;&#xB97C; &#xC0AD;&#xC81C;&#xD558;&#xB3C4;&#xB85D; &#xC720;&#xB3C4;&#xD574;&#xC57C; &#xD558;&#xB294;&#xB370;, &#xC774;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD0A4; &#xC0BD;&#xC785; &#xD6C4; &#xD558;&#xC774;&#xBE0C;&#xC758; &#xB9C8;&#xC6B4;&#xD2B8;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xACE0; HEX &#xD3B8;&#xC9D1;&#xAE30;&#xB85C; &#xD558;&#xC774;&#xBE0C; &#xD30C;&#xC77C;&#xC758; &#xD0A4; &#xBAA9;&#xB85D;&#xC758; &#xC21C;&#xC11C;&#xB97C; &#xC784;&#xC758;&#xB85C; &#xBCC0;&#xACBD;&#xD574; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC744; &#xAE68;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xB2EC;&#xC131;&#xD560; &#xC218; &#xC788;&#xB2E4;. </p>
<blockquote>
<p>&#xC5ED;&#xC790;:<br>&#xD558;&#xC774;&#xBE0C; &#xB9C8;&#xC6B4;&#xD2B8; &#x2192; &#xD45C;&#xC900; API&#xB85C; &#xBE48; &#xD0A4; &#xC0DD;&#xC131; &#x2192; &#xB9C8;&#xC6B4;&#xD2B8; &#xD574;&#xC81C; &#x2192; &#xD558;&#xC774;&#xBE0C; &#xD30C;&#xC77C;&#xC758; &#xD0A4; &#xC21C;&#xC11C; &#xBCC0;&#xACBD;<br>&#xC73C;&#xB85C; &#xB098;&#xD0C0;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br><br>&#xC704; &#xC124;&#xBA85;&#xC758; &#xC608;&#xC2DC;&#xB294; &#xC544;&#xB798; ELAM &#xD558;&#xC774;&#xBE0C;&#xC758; &#xB808;&#xC774;&#xC544;&#xC6C3;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC774;&#xD574;&#xAC00; &#xC27D;&#xB2E4;.</p>
<ol>
<li>Key: Windows Defender<ul>
<li>Value: Measured</li>
</ul>
</li>
<li>Key: zz<ul>
<li>No values</li>
</ul>
</li>
</ol>
<blockquote>
<p>&#xD0A4; &#xC21C;&#xC11C;&#xB294; &#xB8E8;&#xD2B8; &#xD0A4;&#xC758; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0;&#xC788;&#xB294; &#xD0A4; &#xB178;&#xB4DC; &#xC624;&#xD504;&#xC14B; &#xC21C;&#xC11C;&#xB97C; &#xBC18;&#xC601;</p>
</blockquote>
<p>&#xC704;&#xB294; &#xD45C;&#xC900; API &#xD638;&#xCD9C;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#x201C;zz&#x201D; &#xD0A4;&#xB97C; &#xC0BD;&#xC785;&#xD55C; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xB808;&#xC774;&#xC544;&#xC6C3;&#xC774;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC6D0;&#xD558;&#xB294; &#xB2E4;&#xC74C; &#xB808;&#xC774;&#xC544;&#xC6C3;&#xC744; &#xC5BB;&#xAE30; &#xC704;&#xD574; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC744; &#xC218;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.</p>
<ol>
<li>Key: zz<ul>
<li>No values</li>
</ul>
</li>
<li>Key: Windows Defender<ul>
<li>Value: Measured</li>
</ul>
</li>
</ol>
<blockquote>
<p>&#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0;&#xC11C; &#xB450; &#xC694;&#xC18C;&#xC758; &#xC21C;&#xC11C;&#xB97C; &#xBC18;&#xB300;&#xB85C;&#xD558;&#xBA74; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
</blockquote>
<p><br><br>&#xC774;&#xC81C; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC774; &#xAE68;&#xC84C;&#xB2E4;. </p>
<pre><code class="hljs c">Upcase(<span class="hljs-string">&quot;zz&quot;</span>) &gt; Upcase(<span class="hljs-string">&quot;Windows Defender&quot;</span>)</code></pre>
<p>Windows Kernel&#xC740; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC774; &#xAE68;&#xC84C;&#xC73C;&#xBBC0;&#xB85C; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#x201C;Windows Defender&#x201D;&#xD0A4;&#xB97C; &#xC0AD;&#xC81C;&#xD55C;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; Windows Loader&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xC190;&#xC0C1;&#xC744; &#xC778;&#xC2DD;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xACE0;, &#xCE21;&#xC815;&#xD560; &#xAC12;&#xC774; &#xC5C6;&#xB294; &#x201C;zz&#x201D;&#xD0A4;&#xB97C; &#xAC74;&#xB108;&#xB6F0;&#xC5B4; &#xC774;&#xBBF8; &#xC0AD;&#xC81C;&#xB41C; &#x201C;Windows Defender&#x201D; &#xD0A4;&#xC5D0; &#xC788;&#xB294; &#x201C;Measured&#x201D;&#xAC12;&#xC744; &#xCE21;&#xC815;&#xD55C;&#xB2E4;. </p>
<p>&#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xB294; ELAM blob&#xC774; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xC804;&#xC5D0; &#xC0AD;&#xC81C;&#xB420; &#xC218; &#xC788;&#xC74C;&#xC744; &#xBCF4;&#xC5EC;&#xC900;&#xB2E4;.</p>
<h3 id="Root-cause"><a href="#Root-cause" class="headerlink" title="Root cause"></a>Root cause</h3><p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; Windows Loader&#xAC00; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0; &#xC788;&#xB294; &#xC694;&#xC18C;&#xC758; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC744; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBC1C;&#xC0DD;&#xD55C;&#xB2E4;.</p>
<p>&#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xD615;&#xC2DD;&#xC758; &#xD0A4; &#xC774;&#xB984;&#xC774; &#xD5C8;&#xC6A9;&#xB418;&#xACE0;, Windows Loader&#xC5D0;&#xB294; &#xC801;&#xC808;&#xD55C; &#xB300;&#xC18C;&#xBB38;&#xC790; &#xD14C;&#xC774;&#xBE14;(&#xBB38;&#xC790;&#xB97C; &#xB300;&#xBB38;&#xC790;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD14C;&#xC774;&#xBE14;)&#xC774; &#xC5C6;&#xC5B4; &#xB300;&#xC18C;&#xBB38;&#xC790;&#xB97C; &#xAD6C;&#xBD84;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC744; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; Windows Loader&#xC758; &#xD574;&#xB2F9; &#xAE30;&#xB2A5;&#xC774; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xC81C;&#xAC70;&#xB41C; &#xAC83;&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD55C; &#xC6D0;&#xC778;&#xC774; &#xB418;&#xC5C8;&#xB2E4;.</p>
<p>&#xC720;&#xB2C8; &#xCF54;&#xB4DC; &#xB300;&#xBB38;&#xC790; &#xD14C;&#xC774;&#xBE14;&#xC740; Windows Kernel&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C;&#xC740; Kernel&#xC5D0;&#xC11C; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xB2E4;. &#xB610;&#xD55C; Loader&#xC5D0;&#xC11C; &#xC644;&#xD654;&#xB41C; &#xAC80;&#xC0AC;&#xB85C; &#xC778;&#xD574; Kernel &#xC774;&#xC804;&#xC5D0; &#xB85C;&#xB4DC;&#xB41C; &#xD558;&#xC774;&#xBE0C;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC0AC;&#xAE4C;&#xC9C0; &#xB450; &#xBC88; &#xC218;&#xD589;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.<br>&#xD765;&#xBBF8;&#xB86D;&#xAC8C;&#xB3C4;, &#xD604;&#xC7AC; &#xAD6C;&#xD604;&#xC73C;&#xB85C;&#xB294; &#xC720;&#xB2C8; &#xCF54;&#xB4DC; &#xBB38;&#xC790;&#xC5D0; &#xB300;&#xD574; &#xB9AC;&#xD329;&#xD1A0;&#xB9C1; &#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; NLS &#xD14C;&#xC774;&#xBE14;&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xAE30; &#xC804;&#xC5D0; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xB85C;&#xB4DC;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. </p>
<h3 id="Fix-1"><a href="#Fix-1" class="headerlink" title="Fix"></a>Fix</h3><p>Microsoft&#xB294; Windows Loader&#xC5D0; &#xC0AC;&#xC804; &#xC21C; &#xC815;&#xB82C; &#xAC80;&#xC0AC;&#xB97C; &#xB3C4;&#xC785;&#xD558;&#xC5EC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD328;&#xCE58;&#xD588;&#xB2E4;. &#xC720;&#xB2C8; &#xCF54;&#xB4DC; &#xB300;&#xBB38;&#xC790; &#xD14C;&#xC774;&#xBE14;&#xC740; Windows Loader&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C; ASCII &#xBB38;&#xC790;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD0A4; &#xC774;&#xB984;&#xC73C;&#xB85C;&#xB9CC; &#xC81C;&#xD55C;&#xB41C;&#xB2E4;. &#xD604;&#xC7AC; &#xD0A4; &#xC774;&#xB984;&#xC5D0; ASCII &#xBB38;&#xC790; &#xC678;&#xC758; &#xD615;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; ELAM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC5C6;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB41C;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xD328;&#xCE58;&#xB294; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xB97C; &#xAC80;&#xC0AC;&#xD560; &#xB54C; &#xC2EC;&#xAC01;&#xD55C; &#xB370;&#xC774;&#xD130; &#xC190;&#xC0C1; &#xBB38;&#xC81C;&#xC758; &#xC6D0;&#xC778;&#xC774; &#xB41C;&#xB2E4;. SYSTEM &#xD558;&#xC774;&#xBE0C;&#xB294; ELAM &#xD558;&#xC774;&#xBE0C;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xCD08;&#xAE30; &#xBD80;&#xD305; &#xC911;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xB098; ASCII &#xBB38;&#xC790; &#xC678; &#xD615;&#xC2DD;&#xC758; &#xD0A4;&#xB97C; &#xD3EC;&#xD568;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>Windows Loader&#xC758; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xBE44;&#xAD50; &#xD568;&#xC218;&#xB294; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xB300;&#xBB38;&#xC790; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; ASCII &#xC678;&#xC758; &#xBB38;&#xC790;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC774; &#xC5C6;&#xB2E4;. &#xC544;&#xB798; &#xCF54;&#xB4DC;&#xB294; Windows Kernel&#xC5D0;&#xC11C; &#xB450; &#xAC1C;&#xC758; &#xD0A4; &#xC774;&#xB984; (&#xB300;&#xC18C; &#xBB38;&#xC790; &#xAD6C;&#xBD84; &#xC5C6;&#xC74C;)&#xC744; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2017.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2017.png"></p>
<blockquote>
<p>&#xC720;&#xB2C8; &#xCF54;&#xB4DC; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD568;&#xC218;</p>
</blockquote>
<p>&#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xBA74; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774; &#x201C;z&#x201D;(&#x201C;a&#x201D;+ 0x19) &#xBCF4;&#xB2E4; &#xB192;&#xC740; &#xCF54;&#xB4DC;&#xB97C; &#xAC00;&#xC9C4; &#xBB38;&#xC790;&#xC758; &#xACBD;&#xC6B0; &#xBCC0;&#xD658;&#xC774; &#xC218;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xD574;&#xB2F9; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#x201C;&#x44F;&#x201D;&#xC758; &#xB300;&#xBB38;&#xC790; &#xBC84;&#xC804;&#xC740; &#x201C;&#x42F;&#x201D;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#x201C;&#x44F;&#x201D;&#xC774; &#xB41C;&#xB2E4;.</p>
<p>Windows Kernel&#xC5D0;&#xC11C; &#xAD6C;&#xD604;&#xB41C; &#xB3D9;&#xC77C;&#xD55C; &#xD568;&#xC218;&#xB294; &#xC720;&#xB2C8; &#xCF54;&#xB4DC; &#xB300;&#xBB38;&#xC790; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; &#x201C;&#x44F;&#x201D;&#xC758; &#xB300;&#xBB38;&#xC790; &#xBC84;&#xC804;&#xC740; &#x201C;&#x42F;&#x201D;&#xB85C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xC774; &#xB41C;&#xB2E4;. SYSTEM &#xD558;&#xC774;&#xBE0C; &#xB0B4;&#xC758; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC5D0; &#xC788;&#xB294; &#xC694;&#xC18C;&#xB294; &#xC774;&#xC5D0; &#xB530;&#xB77C; &#xC815;&#xB82C;&#xB418;&#xB098; &#xBD80;&#xD305;&#xD558;&#xB294; &#xB3D9;&#xC548;&#xC5D0;&#xB294; Windows Loader&#xC758; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD655;&#xC778;&#xD55C;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; Windows Loader&#xB294; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xC815;&#xB82C;&#xB41C; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC744; &#xC190;&#xC0C1;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xD574; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xC0AD;&#xC81C;&#xD55C;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xC774;&#xC288;&#xB97C; &#xC7AC;&#xD604;&#xD558;&#xB824;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xC0C1;&#xC704; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4; &#xC544;&#xB798;&#xC758; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xC5D0;&#xC11C; &#xC774;&#xB984;&#xC774; &#x201C;&#x44F;1&#x201D;&#xBC0F; &#x201C;&#x42F;2&#x201D;&#xC778; &#xB450; &#xAC1C;&#xC758; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xB9CC;&#xB4E0; &#xB2E4;&#xC74C; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xC7AC;&#xBD80;&#xD305;&#xD558;&#xBA74; &#xB41C;&#xB2E4;.  Windows Kernel&#xC5D0;&#xC11C;&#xB294; &#xD558;&#xC704; &#xD0A4; &#xBAA9;&#xB85D;&#xC774; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC815;&#xB82C;&#xB41C;&#xB2E4;.</p>
<ol>
<li><em>&#x44F;1</em></li>
<li><em>&#x42F;2</em></li>
</ol>
<p>Windows Loader&#xC5D0;&#xC11C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC778;&#xC2DD;&#xD55C;&#xB2E4;. Loader&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xC815;&#xB82C;&#xC744; &#xC190;&#xC0C1;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xC778;&#xC2DD;&#xD574; &#xBD80;&#xD305; &#xD6C4; &#x201C;&#x42F;2&#x201D;&#xD0A4;&#xAC00; &#xC0AD;&#xC81C;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<pre><code class="hljs c">Upcase (<span class="hljs-string">&quot;&#x44F;1&quot;</span>)&gt; Upcase (<span class="hljs-string">&quot;&#x42F;2&quot;</span>), Upcase (<span class="hljs-string">&quot;&#x44F;1&quot;</span>) = <span class="hljs-string">&quot;&#x44F;1&quot;</span></code></pre>
<p>Microsoft&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD655;&#xC778;&#xD588;&#xC9C0;&#xB9CC; &#xBC94;&#xC704;&#xB97C; &#xBC97;&#xC5B4;&#xB0AC;&#xB2E4;&#xB294; &#xC774;&#xC720;&#xB85C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;.</p>
<h3 id="Original-vulnerability-report-1"><a href="#Original-vulnerability-report-1" class="headerlink" title="Original vulnerability report"></a>Original vulnerability report</h3><pre><code class="hljs c"># Summary

A malicious usermode program can modify the ELAM hive (&quot;C:\Windows\System32\config\ELAM&quot;), so its blobs (registry values called &quot;Measured&quot;, &quot;Policy&quot;, and &quot;Config&quot;) are correctly measured on the next boot, but the ELAM driver won&apos;t see them because registry keys containing these blobs are deleted by the NT kernel (even before the BOOT_DRIVER_CALLBACK_FUNCTION callback is registered). 
This results in proper (expected) PCR values but registry values (the ones previously measured) are absent when the ELAM driver tries to read them. So, the system will boot without proper ELAM signatures and this won&apos;t affect the measured boot.

# Description

## Steps to reproduce

(Screenshots attached.)

<span class="hljs-number">1.</span> Mount the ELAM hive <span class="hljs-keyword">using</span> a registry editor.

2. Add the &quot;zz&quot; key under the root key of the ELAM hive, don&apos;t assign any values to this key (see: &quot;01-regedit.png&quot;).

<span class="hljs-number">3.</span> Unmount the ELAM hive.

4. Open the ELAM hive file in a HEX editor (you can open it because it&apos;s not loaded), locate the subkeys list (subkeys of the root key), move the &quot;zz&quot; key to the first position on that list. (A key that was the first one before the move should now occupy the second position on the list. If there are three subkeys, just exchange the first and last keys on the list.)
The idea is to <span class="hljs-keyword">break</span> the lexicographical order of subkeys. So, <span class="hljs-string">&quot;1 2&quot;</span> becomes <span class="hljs-string">&quot;2 1&quot;</span> <span class="hljs-keyword">and</span> <span class="hljs-string">&quot;1 2 3&quot;</span> becomes <span class="hljs-string">&quot;3 2 1&quot;</span> (see: <span class="hljs-string">&quot;02-hexeditor-intact.png&quot;</span> <span class="hljs-keyword">and</span> <span class="hljs-string">&quot;03-hexeditor-modified.png&quot;</span> <span class="hljs-keyword">for</span> <span class="hljs-string">&quot;before&quot;</span> <span class="hljs-keyword">and</span> <span class="hljs-string">&quot;after&quot;</span> states of the hive file respectively).

<span class="hljs-number">5.</span> Reboot the system.

6. When the Windows loader (winload.exe or winload.efi) reads the ELAM hive, it doesn&apos;t check the lexicographical order of subkeys (see: &quot;04-leaf-as-loaded-by-winload.png&quot;). It&apos;s okay for the Windows loader if subkeys are stored in a wrong order.

7. When the Windows loader measures the ELAM hive (in the OslpMeasureEarlyLaunchHive routine), it reads subkeys one-by-one and measures their values (called &quot;Measured&quot;, &quot;Policy&quot;, and &quot;Config&quot;).

8. If you manage to break the lexicographical order of subkeys by inserting empty keys and keeping real (non-empty) keys in the same order (relative to each other, not counting the empty keys), then the Windows loader will measure the usual (expected) data. This can be easily demonstrated with one key &#x2013; &quot;Windows Defender&quot;. 
If you insert the <span class="hljs-string">&quot;zz&quot;</span> key <span class="hljs-keyword">using</span> a registry editor, it goes to the end of the subkeys <span class="hljs-built_in">list</span>. Like <span class="hljs-keyword">this</span>:

- Windows Defender
- zz

If you move the &quot;zz&quot; key to the top (using a HEX editor), the lexicographical order is broken, but since the &quot;zz&quot; key has no values, it doesn&apos;t get measured. And the &quot;Windows Defender&quot; is measured as usual.
9. When the NT kernel starts, it takes hives attached to the loader parameter block and validates them. At this point, the validation routine checks the lexicographical order. If a subkeys list isn&apos;t sorted, offending keys are removed from the list (see: &quot;05-leaf-as-loaded-by-kernel.png&quot;, &quot;06-leaf-as-loaded-by-kernel.png&quot;, and &quot;07-leaf-after-check-by-kernel.png&quot;). 
This means that the <span class="hljs-string">&quot;Windows Defender&quot;</span> key from the example above is removed.

10. When the ELAM driver tries to locate its signatures, they are gone &#x2013; they were removed by the NT kernel because of the hive format violation (see: &quot;08-leaf-as-seen-by-elam.png&quot;).

## Possible solutions

Either check the lexicographical order of subkeys in the Windows loader (which requires you to pick the NLS tables first) or measure empty keys together with non-empty ones.</code></pre>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC758; &#xAD00;&#xB828; &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7;&#xC740; &#xC544;&#xB798;&#xC5D0; &#xCCA8;&#xBD80;&#xB418;&#xC5B4; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2018.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2018.png"></p>
<blockquote>
<p>01-regedit.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2019.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2019.png"></p>
<blockquote>
<p>02-hexeditor-intact.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2020.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2020.png"></p>
<blockquote>
<p>03-hexeditor-modified.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2021.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2021.png"></p>
<blockquote>
<p>04-leaf-as-loaded-by-winload.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2022.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2022.png"></p>
<blockquote>
<p>05-leaf-as-loaded-by-kernel.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2023.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2023.png"></p>
<blockquote>
<p>06-leaf-as-loaded-by-kernel.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2024.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2024.png"></p>
<blockquote>
<p>07-leaf-after-check-by-kernel.png</p>
</blockquote>
<p><img src="/2021/06/27/l0ch/measured-boot-vuln/Untitled%2025.png" srcset="/img/loading.gif" alt="measured-boot-vuln/Untitled%2025.png"></p>
<blockquote>
<p>08-leaf-as-seen-by-elam.png</p>
</blockquote>
<hr>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/cve/">cve</a>
                  
                  <a class="hover-with-bg" href="/tags/kernel/">kernel</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/malware/">malware</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/boot-security/">boot security</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/06/28/idioth/2021-06-28/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] Process Injection without Write/Execute Permission</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/06/27/j0ker/2021-06-27/">
                    <span class="hidden-mobile">[하루한줄] PAC와 PAC Forgery</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/06/27/l0ch/measured-boot-vuln/';
        this.page.identifier = '/2021/06/27/l0ch/measured-boot-vuln/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Measured Boot와 멀웨어 시그니처: Windows Loader에서 발견된 두 가지 취약점&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
