

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">

  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] ZDI에서 선정한 2020년 제일 중요한 취약점 Top 5 - hackyboiz">
  <meta property="og:description" content="hack &amp; life">
  <meta property="og:image" content="/img/favicon.ico">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/03/21/j0ker/zdi_2020_vuln/">

  <title>[Translation] ZDI에서 선정한 2020년 제일 중요한 취약점 Top 5 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>

<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-03-21 14:00" pubdate>
      2021년 3월 21일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.9k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      38
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] ZDI에서 선정한 2020년 제일 중요한 취약점 Top 5</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. &#xBBFF;&#xAC70; &#xC870; &#xC528; &#xC9D1;&#xC548; 28&#xB300;&#xC190; Joker(&#xC870;-&#xCEE4;)&#xC785;&#xB2C8;&#xB2E4;. &#xCCAB; &#xAE00;&#xC740; &#xBD80;&#xB2F4;&#xC2A4;&#xB7FD;&#xC9C0; &#xC54A;&#xAC8C; &#xBC88;&#xC5ED;&#xAE00;&#xB85C; &#xC900;&#xBE44;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C; &#xC7AC;&#xBBF8;&#xC788;&#xB294; &#xC5F0;&#xAD6C; &#xB9CE;&#xC774; &#xD574;&#xC11C; &#xC88B;&#xC740; &#xAE00; &#xC62C;&#xB824;&#xB4DC;&#xB9AC;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; (<strong> </strong>) &#xCC38;&#xACE0;&#xB85C; &#xBC88;&#xC5ED;&#xC5D0;&#xB294; &#xC758;&#xC5ED;&#xC774; &#xB9CE;&#xC744; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xAC78;&#xB85C; &#xD0DC;&#xD074; &#x3134;&#x3134;</p>
<p><img src="/2021/03/21/j0ker/zdi_2020_vuln/Untitled.png" srcset="/img/loading.gif" alt></p>
<p>&#xB450;&#xB450;&#xB4F1;&#xC7A5;</p>
<hr>
<p>&#xC5F0;&#xB9D0;&#xC774; &#xB418;&#xBA74;&#xC11C;, &#xC6B0;&#xB9AC;&#xB294; 2020&#xB144;&#xC5D0; &#xBC1B;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xB4A4;&#xB3CC;&#xC544; &#xBCF4;&#xBA74;&#xC11C; &#xCD5C;&#xACE0;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xBF51;&#xC544;&#xBCF4;&#xBA74; &#xC5B4;&#xB5A8;&#xAE4C;&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC744; &#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;. &#xC0DD;&#xAC01;&#xC740; &#xC774;&#xB807;&#xAC8C; &#xD588;&#xC9C0;&#xB9CC;, &#xC791;&#xB144;&#xC5D0;(&#xAE00;&#xC740; &#xC791;&#xB144;&#xC5D0; &#xB098;&#xC628; &#xAC70;&#xB77C; &#xC62C;&#xD574;&#xB77C;&#xACE0; &#xB418;&#xC5B4; &#xC788;&#xC9C0;&#xB9CC; &#xC77D;&#xAE30; &#xD3B8;&#xD558;&#xB3C4;&#xB85D; &#xD604;&#xC7AC; &#xC2DC;&#xC810;&#xC5D0;&#xC11C; &#xC791;&#xB144;&#xC774;&#xB77C; &#xD558;&#xACA0;&#xB2E4;) &#xC6B0;&#xB9AC;&#xAC00; &#xACF5;&#xAC1C;&#xD55C; Advisor&#xB4E4;&#xC758; &#xC218;&#xAC00; &#xAC70;&#xC758; &#xCD5C;&#xACE0;&#xC5D0; &#xB2E4;&#xB2E4;&#xB790;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; 1400&#xAC1C;&#xAC00; &#xB118;&#xB294; &#xBC84;&#xADF8;&#xB4E4; &#xC911;&#xC5D0;&#xC11C; &#xCD5C;&#xACE0;&#xC758; &#xBC84;&#xADF8; 5&#xAC1C;&#xB97C; &#xACE8;&#xB77C;&#xB0B4;&#xB294; &#xAC83;&#xC740; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xC5B4;&#xB824;&#xC6B4; &#xC77C;&#xC774;&#xC5C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xB9C8;&#xCE68;&#xB0B4; &#xC6B0;&#xB9AC;&#xB294; 2020&#xB144;&#xC5D0; &#xC81C;&#xCD9C;&#xB41C; &#xBC84;&#xADF8;&#xB4E4; &#xC911; &#xCD5C;&#xACE0;&#xC758; &#xBC84;&#xADF8; Top 5&#xB97C; &#xAF3D;&#xC544;&#xBCF4;&#xC558;&#xB2E4;! &#xC9DC;&#xC794;!</p>
<h1 id="CVE-2020-0688-ZDI-20-258"><a href="#CVE-2020-0688-ZDI-20-258" class="headerlink" title="CVE-2020-0688/ZDI-20-258"></a>CVE-2020-0688/ZDI-20-258</h1><p><strong>Microsoft Exchange Server Exchange Control Panel Fixed Cryptographic Key Remote Code Execution Vulnerability</strong></p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; Microsoft Exchange Server&#xC758; Exchange Admin Center &#xC6F9; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xB9E4;&#xC6B0; &#xD06C;&#xB9AC;&#xD2F0;&#xCEEC;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;, &#xC778;&#xC99D;&#xB41C; Exchange &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD1B5;&#xD574; &#xC11C;&#xBC84;&#xC758; SYSTEM &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB2E4;. &#xC774; &#xC6F9; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB294; &#x201C;Admin&#x201D; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB77C;&#xACE0; &#xBD88;&#xB9AC;&#xAE30;&#xB294; &#xD558;&#xC9C0;&#xB9CC;, Exchange &#xC11C;&#xBC84;&#xC758; mailbox&#xC5D0; &#xB300;&#xD55C; &#xC778;&#xC99D;&#xC11C;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xC720;&#xC800;&#xB77C;&#xBA74; &#xBAA8;&#xB450; &#xC811;&#xADFC;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xBA70; Outlook Web Access&#xC640; &#xAC19;&#xC774; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB178;&#xCD9C;&#xB418;&#xC5B4; &#xC788;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; Exchange Admin Center ASP.NET&#xC5D0; &#xC124;&#xCE58;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xC554;&#xD638;&#xD654; &#xD0A4;(&#x201C;machine keys&#x201D;)&#xC640; &#xC5F0;&#xAD00;&#xC774; &#xC788;&#xB2E4;. Exchange&#xC5D0;&#xC11C;&#xB294; &#xC124;&#xCE58;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC774; &#xD0A4;&#xB4E4;&#xC744; &#xB79C;&#xB364;&#xD558;&#xAC8C; &#xC0DD;&#xC131;&#xD558;&#xC5EC; &#xD574;&#xB2F9; &#xD0A4;&#xAC00; &#xC720;&#xB2C8;&#xD06C;&#xD558;&#xACE0; &#xC548;&#xC804;&#xD558;&#xB3C4;&#xB85D; &#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC;, &#xC2E4;&#xC81C;&#xB85C;&#xB294; &#xC774; &#xD0A4;&#xB4E4;&#xC744; install media&#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xBCF5;&#xC0AC;&#xD574;&#xC624;&#xB294;&#xB370;, &#xC774;&#xB85C; &#xC778;&#xD574; &#xD574;&#xCEE4;&#xAC00; &#xB2E4;&#xB978; &#xC81C;&#xD488;&#xC758; installation&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC5EC; &#xC774; &#xD0A4;&#xB4E4;&#xC744; &#xC54C; &#xC218; &#xC788;&#xB2E4;. &#xD574;&#xCEE4;&#xB294; &#xC774; &#xD0A4;&#xB4E4;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC11C;&#xBC84;&#xC5D0; &#xC870;&#xC791;&#xB41C; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0B4;&#xACE0;, &#xD574;&#xB2F9; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; deserialize &#xB418;&#xBA74;&#xC11C; arbitrary code execution&#xC744; &#xD560; &#xC218; &#xC788;&#xB2E4;. Exchange&#xB294; &#xBCF4;&#xD1B5; &#xC5D4;&#xD130;&#xD504;&#xB77C;&#xC774;&#xC988;&#xC758; &#xC911;&#xC2EC;&#xC5D0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Exchange Server&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD558;&#xACE0; &#xD574;&#xCEE4;&#xB4E4;&#xB3C4; &#xB9E4;&#xC6B0; &#xD0D0;&#xB0B8;&#xB2E4;. &#xB9CC;&#xC57D; &#xB2F9;&#xC2E0;&#xC758; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xC544;&#xC9C1; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD328;&#xCE58;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xBA74;, &#xCD5C;&#xB300;&#xD55C; &#xBE68;&#xB9AC; &#xD328;&#xCE58;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xAE38; &#xBC14;&#xB780;&#xB2E4;. &#xC880; &#xB354; &#xB514;&#xD14C;&#xC77C;&#xD55C; &#xB0B4;&#xC6A9;&#xB4E4;&#xC740; &#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.zerodayinitiative.com/blog/2020/2/24/cve-2020-0688-remote-code-execution-on-microsoft-exchange-server-through-fixed-cryptographic-keys">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h1 id="CVE-2020-3992-ZDI-20-1377"><a href="#CVE-2020-3992-ZDI-20-1377" class="headerlink" title="CVE-2020-3992/ZDI-20-1377"></a>CVE-2020-3992/ZDI-20-1377</h1><p><strong>VMware ESXi SLP Use-After-Free Remote Code Execution Vulnerability</strong></p>
<p>&#xC774; &#xBC84;&#xADF8;&#xB294; ZDI &#xCDE8;&#xC57D;&#xC810; &#xC5F0;&#xAD6C;&#xC6D0; Lucas Leong&#xC774; &#xBC1C;&#xACAC;&#xD55C; &#xBC84;&#xADF8;&#xC774;&#xB2E4;. ESXi&#xB294; VMWare &#xC0AC;&#xC5D0;&#xC11C; &#xAC1C;&#xBC1C;&#xD55C; &#xC5D4;&#xD130;&#xD504;&#xB77C;&#xC774;&#xC988;&#xAE09; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC774;&#xB2E4;. Service Location Protocol(SLP)&#xB294; ESXi&#xC5D0; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC911; &#xD558;&#xB098;&#xC774;&#xB2E4;. SDP&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD0D0;&#xC0C9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774;&#xB2E4;. SLP&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC778;&#xAE30; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC774; OpenSLP&#xC778;&#xB370;, Lucas&#xB294; ESXi&#xC5D0;&#xC11C; &#xC790;&#xCCB4; &#xC81C;&#xC791;&#xD55C; &#xBC84;&#xC804;&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xC600;&#xB2E4;. &#xAC70;&#xAE30;&#xB2E4;&#xAC00; &#xC774; &#xC790;&#xCCB4; &#xC81C;&#xC791; &#xBC84;&#xC804;&#xC5D0;&#xC11C; &#xD06C;&#xB9AC;&#xD2F0;&#xCEEC;&#xD55C; &#xCDE8;&#xC57D;&#xC810; &#xB450; &#xAC1C;&#xAC00; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.zerodayinitiative.com/advisories/ZDI-20-1377/">&#xCCAB; &#xBC88;&#xC9F8; &#xCDE8;&#xC57D;&#xC810;</a>&#xC740; Use-After-Free(UAF) &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; <code>SLPDPorcessMessage()</code>&#xC5D0;&#xC11C; SLPMessage &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xAC00; free &#xB418;&#xC5C8;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; SLPDatabase &#xAD6C;&#xC870;&#xCCB4;&#xC5D0;&#xC11C; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB808;&#xD37C;&#xB7F0;&#xC2A4; &#xD558;&#xACE0; &#xC788;&#xC5B4; &#xBC1C;&#xC0DD;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; WAN &#xD658;&#xACBD;&#xC5D0; &#xC788;&#xB294; &#xD574;&#xCEE4;&#xC5D0; &#xC758;&#xD574; &#xD65C;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB2E4;.  </p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB41C; &#xC774;&#xD6C4;, VMware&#xB294; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD328;&#xCE58;&#xD558;&#xC600;&#xC9C0;&#xB9CC; &#xC81C;&#xB300;&#xB85C; &#xCC98;&#xB9AC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xC600;&#xACE0; ZDI-CAN-12190&#xC73C;&#xB85C; &#xD328;&#xCE58;&#xC5D0; &#xB300;&#xD55C; bypass &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC81C;&#xBCF4;&#xB418;&#xC5C8;&#xB2E4;. </p>
<p>&#xB610; &#xD55C; &#xAC00;&#xC9C0; &#xC8FC;&#xBAA9;&#xD560;&#xB9CC;&#xD55C; &#xC810;&#xC740; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC6D0;&#xACA9;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xD560; &#xC218; &#xC788;&#xAE30;&#xB3C4; &#xD558;&#xC9C0;&#xB9CC;, &#xC81C;&#xD55C;&#xB41C; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C;&#xC758; sandbox escape&#xB3C4; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD1B5;&#xD574;, EXSi &#xAC19;&#xC774; &#xB9CE;&#xC774; &#xC5F0;&#xAD6C;&#xB41C; &#xC81C;&#xD488;&#xB4E4;&#xC5D0;&#xC11C;&#xB3C4; &#xC544;&#xC9C1; &#xC54C;&#xC9C0; &#xBABB;&#xD588;&#xB358;(&#xC798; &#xC0B4;&#xD3B4;&#xBCF4;&#xC9C0; &#xC54A;&#xC558;&#xB358;) attack surface&#xB4E4;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xB2E4;.</p>
<h1 id="CVE-2020-9850-ZDI-20-672"><a href="#CVE-2020-9850-ZDI-20-672" class="headerlink" title="CVE-2020-9850/ZDI-20-672"></a>CVE-2020-9850/ZDI-20-672</h1><p><strong>Apple Safari in Operator JIT Type Confusion Remote Code Execution Vulnerability</strong></p>
<p>&#xC774; &#xBC84;&#xADF8;&#xB294; Georgia Tech Systems Software &amp; Security Lab&#xD300;&#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://taesoo.kim/pubs/2020/jin:pwn2own2020-safari-slides.pdf">Pwn2Own&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xBA74;&#xC11C;</a> &#xC81C;&#xBCF4;&#xD55C; &#xBC84;&#xADF8;&#xC774;&#xB2E4;. &#xC774; &#xBC84;&#xADF8;&#xB294; DFG &#xB2E8;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; Webkit type confusion&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xB418;&#xB294; &#xBC84;&#xADF8; &#xCCB4;&#xC778;&#xC758; &#xD55C; &#xBD80;&#xBD84;&#xC73C;&#xB85C; &#xC791;&#xB144;&#xC5D0; &#xBC1C;&#xACAC;&#xB41C; &#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.zerodayinitiative.com/blog/2019/11/25/diving-deep-into-a-pwn2own-winning-webkit-bug">&#xBC84;&#xADF8;</a>&#xC640; &#xC720;&#xC0AC;&#xD558;&#xB2E4;. OpenGL&#x2019;s CVM(Core Virtual Machine)&#xC758; &#xD799; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0; &#xBC84;&#xADF8;&#xC640; &#xCCB4;&#xC774;&#xB2DD; &#xD558;&#xBA74; &#xC0AC;&#xD30C;&#xB9AC;&#xC5D0;&#xC11C; &#x201C;.app&#x201D; symlink&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#xB808;&#xC774;&#xC2A4; &#xCEE8;&#xB514;&#xC158;&#xC744; &#xD1B5;&#xD574; cfprefsd&#xC640; kextload&#xC5D0;&#xC11C; first-time app protection &#xC6B0;&#xD68C;, root &#xC811;&#xADFC;, &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC774; &#xCC28;&#xB840;&#xB300;&#xB85C; &#xC774;&#xB904;&#xC9C0;&#xBA70; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC740; &#xD53C;&#xD574;&#xC790;&#xAC00; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xBC29;&#xBB38;&#xD558;&#xACE0; &#xB09C; &#xD6C4; &#xBC31;&#xADF8;&#xB77C;&#xC6B4;&#xB4DC;&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4;&#xB2E4;. </p>
<p>&#xD55C; &#xC6F9; &#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xC811;&#xC18D;&#xD588;&#xB294;&#xB370; 10&#xCD08; &#xD6C4;&#xC5D0; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xB2F9;&#xC2E0;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB77C;. &#xC18C;&#xB984;&#xC774; &#xB3CB;&#xC744; &#xC815;&#xB3C4;&#xC774;&#xB2E4;. &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xADF8;&#xB4E4;&#xC740; Pwn2Own&#xC5D0;&#xC11C; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xB370;&#xBAA8;&#xB97C; &#xB9C8;&#xCCD0; $70,000&#xB97C; &#xD68D;&#xB4DD;&#xD558;&#xC600;&#xB2E4;. </p>
<h1 id="CVE-2020-7460-ZDI-20-949"><a href="#CVE-2020-7460-ZDI-20-949" class="headerlink" title="CVE-2020-7460/ZDI-20-949"></a>CVE-2020-7460/ZDI-20-949</h1><p><strong>FreeBSD Kernel sendmsg System Call Time-Of-Check Time-Of-Use Privilege Escalation Vulnerability</strong></p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; m00nbsd&#xB77C;&#xB294; &#xB2C9;&#xB124;&#xC784;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD55C; &#xC5F0;&#xAD6C;&#xC6D0;&#xC774; ZDI&#xC5D0; &#xC81C;&#xBCF4;&#xD558;&#xC600;&#xB2E4;. &#xD574;&#xCEE4;&#xB294; FreeBSD&#xC758; 32-bit <code>sendmsg()</code> &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; Time-Of-Check, Time-Of-Use(TOCTOU) &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xB0AE;&#xC740; &#xAD8C;&#xD55C;&#xC5D0;&#xC11C; kernel-level code execution&#xC744; &#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; double-fetch &#xBC84;&#xADF8;&#xB85C; &#xC720;&#xC800; &#xB79C;&#xB4DC;&#xC5D0; &#xC788;&#xB294; MsgLen &#xBCC0;&#xC218;&#xC5D0; &#xCCAB; access&#xAC00; &#xC788;&#xACE0; &#xB09C; &#xD6C4;, &#xB450; &#xBC88;&#xC9F8; access&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xB354; &#xD070; &#xAC12;&#xC73C;&#xB85C; &#xBC14;&#xAFB8;&#xBA74; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD574;&#xCEE4;&#xB294; &#xB8E8;&#xD504;&#xC5D0;&#xC11C; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xC778;&#xC790;&#xB85C; <code>sendmsg()</code>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xD558;&#xB098;&#xC640; MsgLen&#xC744; &#xD070; &#xAC12;&#xC73C;&#xB85C; &#xC870;&#xC791;&#xD558;&#xB294; &#xC2A4;&#xB808;&#xB4DC; &#xD558;&#xB098;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xB808;&#xC774;&#xC2A4; &#xCEE8;&#xB514;&#xC158;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xCF1C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774; &#xBC84;&#xADF8;&#xC758; &#xB09C;&#xC774;&#xB3C4;&#xB294; &#xB0AE;&#xC9C0;&#xB9CC; &#xBE44;&#xAD50;&#xC801; &#xC624;&#xB7AB;&#xB3D9;&#xC548; &#xC0B4;&#xC544;&#xB0A8;&#xC558;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC791;&#xB144; 9&#xC6D4;&#xC5D0; &#xC774; &#xBC84;&#xADF8;&#xC5D0; &#xB300;&#xD574; &#xD3EC;&#xC2A4;&#xD305;&#xC744; &#xD558;&#xC600;&#xC73C;&#xB2C8; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xB2E4;&#xBA74; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.zerodayinitiative.com/blog/2020/9/1/cve-2020-7460-freebsd-kernel-privilege-escalation">&#xC5EC;&#xAE30;</a>&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h1 id="CVE-2020-17057-ZDI-20-1371"><a href="#CVE-2020-17057-ZDI-20-1371" class="headerlink" title="CVE-2020-17057/ZDI-20-1371"></a><a href="https://hackyboiz.github.io/2021/01/01/l0ch/2021-01-01/">CVE-2020-17057</a>/ZDI-20-1371</h1><p><strong>Microsoft Windows DirectComposition Uninitialized Pointer Privilege Escalation Vulnerability</strong></p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; Windows&#xC758; DirectComposition&#xC774;&#xB77C;&#xB294; &#xCEE4;&#xB110; &#xBAA8;&#xB4DC;&#xC758; &#xADF8;&#xB798;&#xD53D; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB2E4;. <code>win32kbase!DirectComposition::CInteractionTrackerMarshaler::SetBufferProperty</code> &#xD568;&#xC218;&#xB294; &#xC720;&#xC800; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC804;&#xB2EC;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; <code>DirectComposition::CInteractionTrackerMarshaler</code> &#xD0C0;&#xC785;&#xC758; &#xAC1D;&#xCCB4;&#xB97C; &#xCC44;&#xC6B4;&#xB2E4;. &#xB9CC;&#xC57D; &#xD568;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBE44;&#xC815;&#xC0C1;&#xC801;&#xC778; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBC1C;&#xACAC;&#xD558;&#xBA74;, &#xC5D0;&#xB7EC;&#xB97C; &#xD578;&#xB4E4;&#xB9C1;&#xD558;&#xB294; &#xBD84;&#xAE30;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xAC8C; &#xB418;&#xB294;&#xB370;, &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD55C; &#xAC1D;&#xCCB4;&#xC5D0; &#xC788;&#xB294; &#xB9AC;&#xC18C;&#xC2A4;&#xB4E4;&#xC744; release &#xD55C;&#xB2E4;. Release &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD3EC;&#xC778;&#xD130;&#xB97C; release &#xD558;&#xAC8C; &#xB41C;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xD574;&#xCEE4;&#xB294; &#xCEE4;&#xB110; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xACE0; &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; SYSTEM &#xAD8C;&#xD55C;&#xC744; &#xD68D;&#xB4DD;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/cve/">cve</a>
                  
                  <a class="hover-with-bg" href="/tags/j0ker/">j0ker</a>
                  
                  <a class="hover-with-bg" href="/tags/zdi/">zdi</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_j0ker.jpg" srcset="/img/loading.gif" alt="j0ker">
                  </div>

                  <div class="link-text">
                    <div class="link-title">j0ker</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/j0ker">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/03/21/insu/2021-03-21/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] VestaCP Local Privilege Escalation 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/03/20/fabu1ous/2021-03-20/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-21315: node js library command injection</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/03/21/j0ker/zdi_2020_vuln/';
        this.page.identifier = '/2021/03/21/j0ker/zdi_2020_vuln/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] ZDI에서 선정한 2020년 제일 중요한 취약점 Top 5&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
